{
  "backend/main.mo": "Defines the main canister with user profiles, credentials, server management, access control checks, and endpoints for creating and querying servers and profiles.",
  "backend/migration.mo": "Provides a migration function that adds empty server and serverMembers maps when upgrading from the old actor state.",
  "feature_evidence.json": "Feature evidence report linking a specific frontend feature to related files, components, and tests with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior of various frontend components, hooks, pages, and state providers.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global background, text, and border styles.",
  "frontend/index.html": "Basic HTML entry point containing a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main app component handling authentication flow, profile setup, layout rendering, and conditional overlays based on navigation state.",
  "frontend/src/auth/authMessages.ts": "Defines authentication message constants and utilities to sanitize and categorize error messages for different auth flows.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication provider managing session restoration, login, registration, logout, initialization timeouts, and backend connection state.",
  "frontend/src/auth/sessionStorage.ts": "Handles saving, loading, validating, and clearing auth session data in localStorage with expiration handling.",
  "frontend/src/auth/useAuth.ts": "Re-exports and wraps the auth context hook for accessing authentication state.",
  "frontend/src/components/auth/AuthLayout.tsx": "Provides a centered layout wrapper for auth pages with a title, optional description, and logo.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a channel category with support for admin-only drag-and-drop ordering and channel creation.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating new categories with validation, backend-guard checks, and error handling.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels in a category with type selection and mutation state handling.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer for text channels supporting sending messages, enter-to-send, and backend action restrictions.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected text channel, auto-scrolls on updates, and renders the chat composer.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with avatar, username, timestamp, and profile-click handling.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Shows public servers with search filtering and join actions.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Displays a server preview card with name, description, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home view with a friends tab fallback and empty-state messaging.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend's avatar, name, status, and action buttons including messaging and dropdown options.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for viewing friends, pending requests, and adding friends with related actions.",
  "frontend/src/components/layout/DesktopShell.tsx": "Arranges the desktop layout with server rail, sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Determines and renders the main view based on navigation state including chat, DMs, discovery, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Implements mobile layout with sheets for servers, channels, members, and settings.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Chooses mobile or desktop shell based on window width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Displays a scrollable list of server members, fetching profiles and allowing member selection.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Renders the channel sidebar with categories, drag‑and‑drop ordering, and admin category management.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Provides a mobile top navigation bar with server, channel, member, and settings controls.",
  "frontend/src/components/nav/ServerRail.tsx": "Shows the vertical server list with ordering, navigation, and a dialog to create new servers.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A dialog for first‑time profile setup, letting users confirm or edit their display name.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing roles from a server member with async role updates.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Displays a full user profile overlay with banner, avatar, details, and optional role management.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog component for creating a server with name and description, handling backend readiness and mutation states.",
  "frontend/src/components/servers/ServerIcon.tsx": "Displays a server’s icon image or a fallback initial if no icon URL exists.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels within a category, handling backend mutations and validation.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog for moving a channel to another category, offering category selection and pending-state handling.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member and viewing or managing their assigned roles through a role dialog.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays and formats server audit log entries with loading, error, and empty states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Provides UI and logic for ordering text and voice channels within categories, including move-up/down actions and persisting updated ordering.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Allows viewing and editing basic server settings like description, banner, icon, and community mode.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Displays server members and their roles, lets the user select a member, view roles, and open a dialog to manage assignments.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Enables creating new roles, viewing existing roles, and accessing member role assignment tools.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Main container for server settings navigation and rendering pages like overview, roles, channels, and audit log.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Allows users to change theme and adjust text scale preferences.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Renders user profile and username settings with form state, loading states, and save handlers using query hooks.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Renders the user settings layout with navigation between profile and appearance pages and includes logout handling.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Displays backend connection status with loading, error instructions, and retry handling.",
  "frontend/src/components/voice/StageView.tsx": "Shows a static stage channel UI listing speakers and audience with avatars and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Manages voice channel connection, participant display, and user mute/deafen controls using navigation and query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates related queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Returns a disabled state and reason for actions based on backend connection readiness.",
  "frontend/src/hooks/useBackendConnection.ts": "Determines backend connection state using safe actor initialization and a simple health check with retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context for login, identity loading, and status management using AuthClient.",
  "frontend/src/hooks/useIsMobile.ts": "Tracks window width to determine if the client is below a mobile breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Clears authentication and resets all React Query cache on logout.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for backend user profiles, usernames, and profile mutation, with error handling and backend readiness checks.",
  "frontend/src/hooks/useSafeActor.ts": "Wraps backend actor initialization with runtime method verification and exposes loading, error, and retry state.",
  "frontend/src/index.css": "Sets up Tailwind layers and theme CSS variables for dark and light modes along with base styling globals.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root App component.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign‑in and sign‑up UI with validation, tab switching, and error handling via the auth context.",
  "frontend/src/state/navigation.ts": "Provides navigation context managing current view, selected server/channel, settings panels, and category expansion state.",
  "frontend/src/state/notifications.ts": "Handles localStorage‑backed notification overrides and utilities for checking server or channel mute status.",
  "frontend/src/state/settings.ts": "Stores user settings such as theme, accent color, text scale, notifications, and keybinds with persistence in localStorage.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces for servers, channels, roles, messages, presence, audit logs, and related structures not generated from the backend.",
  "frontend/src/utils/channelOrdering.ts": "Provides functions to merge and apply channel and category ordering, and to rebuild ordering structures from current state.",
  "frontend/src/utils/hideElementByXPath.ts": "Implements XPath-based DOM element removal with an optional MutationObserver for continuous cleanup.",
  "frontend/src/utils/roleColor.ts": "Validates hex color strings, computes luminance, and returns contrast-appropriate text colors.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout using Promise.race to reject if it exceeds a specified duration.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with extended colors, animations, container settings, and plugins for typography, container queries, and animation.",
  "project_state.json": "Stores project metadata, known issues, and pending feature requests related to server creation and backend alignment."
}