{
  "backend/main.mo": "Actor implementing user registration, login, session handling, and profile initialization using maps for credentials and sessions with access control integration.",
  "feature_evidence.json": "Feature evidence report referencing a frontend file update for improved registration error handling.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing app structure, hooks, state, and UI components.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes with global styling rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling auth state, profile setup flow, global providers, and layout rendering.",
  "frontend/src/auth/authMessages.ts": "Centralized user-facing authentication message constants for errors and statuses.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication context managing session restoration, login, registration, logout, and backend session validation.",
  "frontend/src/auth/sessionStorage.ts": "Utility for persisting, loading, validating, and clearing session data in localStorage.",
  "frontend/src/auth/useAuth.ts": "Simple hook exposing the authentication context.",
  "frontend/src/components/auth/AuthLayout.tsx": "Wrapper layout for auth pages with branding, title, optional description, and content slot.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a channel category with expandable sections, channel drag-and-drop ordering, and channel creation controls.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating a new server category with validation, backend guard handling, and error display.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for adding text or voice channels to a category with type selection and mutation handling.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer for sending text channel messages with disabled states and quick action buttons.",
  "frontend/src/components/chat/ChatView.tsx": "Main chat view that loads messages, auto-scrolls, shows channel header, and includes the composer.",
  "frontend/src/components/chat/MessageItem.tsx": "Displays a single chat message with avatar, author info, timestamp, and member profile selection.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Server discovery page with search filtering and join-server actions for community-enabled servers.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Displays a server preview card with name, description, member count, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home screen or friends view, with a placeholder when no direct messages exist.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend's avatar, name, status, and action buttons including messaging and dropdown options.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for managing friends, viewing requests, and sending new friend requests.",
  "frontend/src/components/layout/DesktopShell.tsx": "Desktop layout shell combining server rail, sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which main view to display based on navigation state, including chat, voice, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout with slide-out sheets for servers, channels, members, and settings.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells based on window width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Lists server members with avatars and allows selecting a member for more details.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Displays server categories and channels with ordering, expansion, and admin drag-and-drop support.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Mobile top bar providing navigation buttons and showing the current view or server name.",
  "frontend/src/components/nav/ServerRail.tsx": "Renders the left server navigation rail with home button, ordered server list, add-server button, and settings access. Handles server selection, ordering, and backend action restrictions.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for first‑time user profile setup, allowing entry of a display name and saving via mutation. Prevents empty submissions and shows loading state.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog to assign or remove roles for a user in a server, with pending‑state tracking and async role mutations. Lists all roles with checkboxes and handles loading and empty states.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Overlay showing a member's profile, avatar, banner, roles, and status within a server. Supports role management if the viewer has sufficient permissions.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and description fields, handling submission, validation, and backend restrictions. Resets form state on close and shows creation progress.",
  "frontend/src/components/servers/ServerIcon.tsx": "Displays a server's icon or a fallback initial if no icon exists. Applies rounded styling and hover transitions.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog component for creating text or voice channels, handling form state, category selection, and mutation calls. Includes error display and resets state on close or successful creation.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog for moving a channel to another category, allowing category selection and triggering a move callback. Disables actions while pending and filters out the current category.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member and viewing or managing their assigned roles. Fetches member-role data and opens a role management dialog for the selected user.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Page that loads, formats, sorts, and displays server audit log entries with event types, timestamps, and actors. Handles loading, error, and empty states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Page for viewing and reordering categories and channels, applying persisted ordering and updating ordering via mutations. Includes controls for moving channels and opening the create-channel dialog.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Page for editing server settings such as description, icons, banner, and community mode. Loads server data, updates fields through a mutation, and disables name editing.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Provides UI to select a server member, view their assigned roles, and open a dialog to manage those roles using fetched server data.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Displays server roles, allows creation of new roles with name and color, and lists existing roles with management options.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Container for server settings pages with a sidebar to switch between sections like overview, roles, channels, and audit log. Renders the selected page and provides a close button.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Allows users to change theme preferences and adjust text scale via radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Loads and edits user profile fields and username, providing save actions with loading states.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Wraps the user settings UI with navigation between profile and appearance pages and includes logout handling.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows connection status to the backend with loading, error, and retry UI, including troubleshooting steps on failure.",
  "frontend/src/components/voice/StageView.tsx": "Renders a stage-style voice channel layout with speaker and audience sections and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Renders a voice channel view with participant list, connection controls, and join/leave logic using various backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple disabled/reason state based on backend connection readiness.",
  "frontend/src/hooks/useBackendConnection.ts": "Wraps safe actor initialization with a lightweight health check to expose backend connection state, errors, and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing login, identity loading, and authentication state.",
  "frontend/src/hooks/useIsMobile.ts": "Tracks whether the viewport width is below a configurable breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Clears auth state and React Query cache on logout.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for backend operations including profiles, usernames, servers, roles, and voice presence with error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes a backend actor with identity handling, optional admin token setup, and retry support.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variable themes and utility classes for dark/light modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/LoginScreen.tsx": "Implements a login and registration UI with validation, tab switching, and error handling.",
  "frontend/src/state/navigation.ts": "Provides navigation context managing current view, selected server/channel, tabs, and settings visibility.",
  "frontend/src/state/notifications.ts": "Manages notification override settings in localStorage and checks mute status for servers and channels.",
  "frontend/src/state/settings.ts": "Stores app settings in context with persistence, including theme, accent color, text scale, notifications, and keybinds.",
  "frontend/src/types/backend-extended.ts": "Defines extended backend-related TypeScript types for servers, channels, roles, members, messages, and audit logs.",
  "frontend/src/utils/channelOrdering.ts": "Applies and builds ordering for categories and channels based on persisted server ordering data.",
  "frontend/src/utils/hideElementByXPath.ts": "Removes a specific DOM element identified by XPath and sets up a MutationObserver to keep it removed.",
  "frontend/src/utils/roleColor.ts": "Validates and sanitizes role colors, checks luminance, and determines appropriate contrasting text color.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters and storing or retrieving them from sessionStorage, plus utilities for persisting and clearing parameters.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout using Promise.race and rejects with a custom message if it exceeds the limit.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theme extensions, color variables, animations, and plugins like typography and container queries.",
  "project_state.json": "Tracks project metadata, known issues, features, and pending requests for the Caffeine Chat project."
}