{
  "backend/main.mo": "Defines types and comparison helpers for user profiles, roles, channels, servers, messages, audit logs, and includes authorization mixin state.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their purpose and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup defining global theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Minimal HTML shell mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component wiring authentication, profile setup, theming, navigation, and layout rendering.",
  "frontend/src/auth/AuthProvider.tsx": "Provides custom auth context managing session tokens, login/register placeholders, and session restoration.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, validating, and clearing persisted session data in localStorage.",
  "frontend/src/auth/useAuth.ts": "Simple hook that returns the authentication context.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout wrapper for authentication screens with centered card UI and app branding.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a collapsible category with text and voice channels and a button to create new channels.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Modal dialog to create a new server category, handling form input and backend mutation state.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Modal dialog for creating text or voice channels within a category, with type selection and backend mutations.",
  "frontend/src/components/chat/ChatComposer.tsx": "Input composer for sending messages in a text channel with backend validation and disabled states.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected text channel, auto-scrolls, and includes the message composer.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with avatar, author info, timestamp, and role-based color styling.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Allows users to search and browse community servers and join them.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Displays a server summary card with name, description, member count, and join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows either the friends view or a placeholder direct messages screen based on navigation state.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend entry with avatar, name, status, and action buttons including messaging and profile options.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Displays friends lists, pending requests, and a form to add friends using tabs and query hooks.",
  "frontend/src/components/layout/DesktopShell.tsx": "Lays out the desktop UI with server rail, sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which main view to render based on navigation state, including home, server channels, discovery, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Implements mobile layout with slide‑in sheets for servers, channels, members, and settings.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells based on window width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Shows a scrollable list of server members with avatars, roles, and a click handler to select a member.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Displays either the home sidebar or the server channel/category list with actions and settings.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Top bar for mobile providing navigation buttons, server/channel access, and user settings.",
  "frontend/src/components/nav/ServerRail.tsx": "Renders the left server navigation rail, listing servers in ordered form and providing controls for home navigation and creating a server.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A dialog that prompts users to choose a display name and saves the initial profile on submit.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing roles from a user, with async handling and pending state tracking.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Displays a member’s profile overlay with avatar, banner, roles, and optional role management controls.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and optional description, handling backend limits and form submission.",
  "frontend/src/components/servers/ServerIcon.tsx": "Shows a server’s icon or a fallback initial if no icon URL is provided.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog component for creating text or voice channels, handling form state, category selection, and submitting mutations.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog for moving a channel to another category, providing category selection and invoking a callback on confirmation.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member, viewing their roles, and opening a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays the server audit log with formatted events, timestamps, and user IDs, including loading and error states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages category and channel organization, including creating channels, reordering, and moving channels between categories.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Server settings page for editing description, icon, banner, and community mode, with save functionality tied to backend updates.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "UI panel to select a server member, view their roles, and open a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Displays server roles, allows creating new roles with permissions, and includes a panel for assigning roles to members.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Layout shell for server settings with a sidebar of pages and dynamic page rendering based on selection.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users change theme and adjust text scaling through radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Form for editing user profile fields like username, name, status, about me, and avatar/banner URLs with save actions.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Container for user settings navigation, switching between profile and appearance pages, and providing logout functionality.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/voice/StageView.tsx": "Renders a static stage channel view showing speakers, audience members, and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Handles joining/leaving voice channels, showing participants, and providing basic mute/deafen UI states.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor using the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Determines whether backend actions should be disabled based on connection state and errors.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines safe actor initialization with a backend health check to expose connection status and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login, logout, and identity initialization/loading.",
  "frontend/src/hooks/useIsMobile.ts": "Tracks whether the viewport width is below a given breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Wraps logout logic and clears all react-query caches on logout.",
  "frontend/src/hooks/useQueries.ts": "Defines many backend data queries and mutations with friendly error handling using the backend actor.",
  "frontend/src/hooks/useSafeActor.ts": "Safely creates an authenticated or anonymous backend actor with retry and initialization state tracking.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for dark and light modes.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign-in and sign-up forms with validation and auth error handling.",
  "frontend/src/state/navigation.ts": "Defines navigation context and provider managing view state, selections, settings panels, and category expansion.",
  "frontend/src/state/notifications.ts": "Handles notification override storage in localStorage and provides helpers to check muted servers or channels.",
  "frontend/src/state/settings.ts": "Provides settings context with persistence for theme, accent color, text scale, notifications, and keybinds.",
  "frontend/src/utils/hideElementByXPath.ts": "Removes a specific DOM element via XPath and sets up a MutationObserver to keep removing it if reinserted.",
  "frontend/src/utils/roleColor.ts": "Validates hex role colors and provides luminance-based contrast and light/dark checks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and session parameters, persisting them, and cleaning sensitive params from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, layout, and enabling typography, container queries, and animations.",
  "project_state.json": "Project metadata describing features, requirements, architectural notes, and pending account-system refactor tasks."
}