{
  "backend/main.mo": "Main actor implementing user registration, login, session creation, and profile initialization using access control and in‑memory maps.",
  "backend/migration.mo": "Migration module converting old session format to new structures and initializing empty credential and token maps.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend components covering app structure, auth flows, navigation, settings, and UI elements.",
  "frontend/index.css": "Tailwind base and theme CSS defining light and dark mode CSS variables and global styles.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling auth state, profile setup flow, and rendering the responsive application shell.",
  "frontend/src/auth/authMessages.ts": "Central list of user-facing authentication and session-related message constants.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication provider managing login, registration, session restore, validation, and connection error handling.",
  "frontend/src/auth/sessionStorage.ts": "Provides utilities to save, load, validate, and clear auth session data in localStorage with timestamp normalization.",
  "frontend/src/auth/useAuth.ts": "Re-exports the AuthProvider context hook for accessing auth state.",
  "frontend/src/components/auth/AuthLayout.tsx": "Renders a centered auth page layout with logo, title, optional description, and children content.",
  "frontend/src/components/channels/CategorySection.tsx": "Displays a channel category with drag‑and‑drop reordering, admin checks, and a dialog for creating channels.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for adding a new category to a server with validation, backend guard, and mutation handling.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels with type selection, validation, and mutation state handling.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer allowing users to type and send messages with backend checks and disabled states.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected channel, auto-scrolls, and includes a composer and basic channel header controls.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a chat message with avatar, author name, timestamp, and content, using profile data and navigation handlers.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Displays a searchable list of community servers and allows joining them.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Shows a server preview card with name, description, member count, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home view or friends view, with an empty-state message for no DMs.",
  "frontend/src/components/friends/FriendRow.tsx": "Displays a friend's avatar, name, status, and action buttons for messaging, calling, or managing.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for managing friends, pending requests, and adding new friends.",
  "frontend/src/components/layout/DesktopShell.tsx": "Layouts the desktop UI with server rail, channel sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses and renders the main view based on navigation state, including chat, DM, discovery, or settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout with slide-out sheets for servers, channels, and members, plus main content and settings access.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells based on screen width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Lists server members with profile info and lets users select a member for viewing details.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Renders the server channel sidebar with category display, expansion, drag‑and‑drop reordering, and category creation. Syncs ordering with backend and handles server selection states.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Provides a mobile top navigation bar with buttons to open server, channel, member lists, and user settings. Shows the current server or view title.",
  "frontend/src/components/nav/ServerRail.tsx": "Displays a vertical server list with ordering, home navigation, and a button to create servers. Handles server selection and backend action restrictions.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new users to set a display name and saves the profile via backend mutation. Shows loading state during submission.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing roles from a user, with loading prevention per‑role and scrollable role list. Uses backend mutations to update role membership.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Shows a full user profile overlay with avatar, banner, roles, and admin tools like role assignment. Loads profile, username, roles, and server context data.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and description fields, backend validation, and disabled state handling. Submits server creation and resets state on close.",
  "frontend/src/components/servers/ServerIcon.tsx": "Displays a server icon image or a fallback with the server's initial if no icon is provided.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels, handling form input, category selection, and mutation requests.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog allowing users to move a channel to another category, offering category selection and move confirmation.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member and managing their assigned roles, including viewing and editing role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays the server's audit log with event formatting, sorting, and error/loading states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages channel ordering and creation within categories, including admin-only move actions and ordering persistence.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Displays and edits basic server settings like description, images, and community mode, saving changes via API.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Lets admins pick a server member, view their roles, and open a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Allows creating new server roles and viewing existing ones, with a panel for assigning roles to members.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Provides the layout and navigation for server settings pages, switching views based on the selected section.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users change theme and text scale through radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Fetches and updates user profile fields and username, with forms for editing account details.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Provides the layout and navigation for user settings pages, including profile, appearance, and logout.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows connection status to the backend with loading, error instructions, and retry handling.",
  "frontend/src/components/voice/StageView.tsx": "Displays a static stage channel layout with mock speakers and audience avatars and a button to raise a hand.",
  "frontend/src/components/voice/VoiceView.tsx": "Handles voice channel connection logic, participant display, and mute/deafen state using backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Determines whether backend actions should be disabled based on backend connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Tracks backend connection readiness using a safe actor and a lightweight health check, providing retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity-loading logic via React context and DFINITY AuthClient.",
  "frontend/src/hooks/useIsMobile.ts": "Returns a boolean indicating whether the viewport width is below a given breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Handles logout by clearing auth state and flushing all React Query caches.",
  "frontend/src/hooks/useQueries.ts": "Defines many typed backend queries and mutations for profiles, usernames, servers, channels, messages, and voice presence with friendly error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes a backend actor with identity support, error handling, and retry logic including optional admin-token initialization.",
  "frontend/src/index.css": "Configures Tailwind layers and defines theme CSS variables for dark and light modes plus basic global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign‑in and sign‑up UI with validation, form handling, and error display using the auth hook.",
  "frontend/src/state/navigation.ts": "Provides a React context managing app navigation state, selected server/channel, and settings visibility.",
  "frontend/src/state/notifications.ts": "Manages notification override settings in localStorage and exposes helpers for mute checks.",
  "frontend/src/state/settings.ts": "Implements a settings context storing theme, accent, text scale, notifications, and keybinds with persistence.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces for servers, channels, members, messages, roles, and audit logs.",
  "frontend/src/utils/channelOrdering.ts": "Functions to apply and build custom ordering for categories and channels based on persisted server ordering data.",
  "frontend/src/utils/hideElementByXPath.ts": "Utilities to hide a DOM element by XPath with optional MutationObserver-based continuous removal.",
  "frontend/src/utils/roleColor.ts": "Provides helpers to sanitize hex color strings, detect lightness, and choose contrast text colors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, storing them in sessionStorage, and retrieving or clearing them.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it doesn't resolve within the specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Metadata describing project state, issues, and feature requests for implementing authentication flows."
}