{
  "backend/main.mo": "Main backend actor handling registration, login, session storage, and user profiles with credential maps and access control integration.",
  "backend/migration.mo": "Migration module defining old/new session formats and providing a stubbed migration that initializes a new empty sessionStore.",
  "feature_evidence.json": "Feature evidence report describing improved frontend registration error reporting and listing related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in authentication, navigation, settings, layout, and server/channel UI.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme CSS variables and base element styling.",
  "frontend/index.html": "HTML entry point defining root container and loading the main frontend script.",
  "frontend/src/App.tsx": "Top-level React component wiring authentication, profile setup, navigation, theming, and layout with backend connection handling.",
  "frontend/src/auth/authMessages.ts": "Centralized auth-related user-facing messages plus helpers for error sanitization, categorization, and registration error mapping.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication context provider managing session restoration, login, registration, session validation, and error mapping via backend actor.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, and clearing normalized session data in localStorage with expiration handling.",
  "frontend/src/auth/useAuth.ts": "Exports a hook that returns authentication context for components.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout wrapper for auth pages providing centered card UI with title, description, and logo.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a category with its channels, supporting admin-only drag-and-drop ordering and channel creation.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating a new channel category with backend validation and error handling.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for adding text or voice channels to a category with mutation and form state management.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input box for sending text channel messages with backend readiness checks.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected channel, auto-scrolls, and includes composer and header actions.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a chat message with avatar, author info, timestamp, and click-to-view profile handling.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Displays discoverable community servers with search filtering and join actions.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Shows a styled card for a server including name, description, member count, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home view or friends list, with an empty-state message when no DMs exist.",
  "frontend/src/components/friends/FriendRow.tsx": "Displays a friend's avatar, name, status, and action buttons for messaging, calling, and more options.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for viewing friends, pending requests, and adding friends with request actions.",
  "frontend/src/components/layout/DesktopShell.tsx": "Desktop layout container combining server rail, sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses and renders the correct main view based on navigation state, including settings and channel types.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout with slide-out sheets for servers, channels, members, and access to user settings.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells based on window size.",
  "frontend/src/components/members/MemberListPanel.tsx": "Lists server members with avatars and allows selecting a member; includes per-member row rendering.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Renders the server channel sidebar with category listing, drag-and-drop reordering, and create-category dialog handling.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Displays a mobile top navigation bar with server title and quick-access buttons for servers, channels, members, and settings.",
  "frontend/src/components/nav/ServerRail.tsx": "Shows the vertical server list rail with home, server icons, ordering, and create-server button.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Provides a dialog for first‑time profile setup where users submit a display name.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning and removing server roles from a user with pending-state handling.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Displays a user profile overlay with avatar, banner, roles, and optional role‑management dialog.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and description inputs and backend action guarding.",
  "frontend/src/components/servers/ServerIcon.tsx": "Displays a server’s icon if available or a fallback with the server’s initial letter.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels, handling input, category selection, and mutation submission.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog allowing users to move a channel to another category, validating and submitting the move action.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Shows server members, their roles, and provides a way to open a role management dialog for the selected member.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Fetches and displays sorted audit log entries for the selected server with formatting helpers.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Displays categories and channels, supports creating channels and reordering them using persisted ordering.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Provides a form for viewing and editing server description, media URLs, and community mode, with save functionality via update mutation.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Allows selecting a server member, viewing their roles, and opening a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Displays existing roles and provides UI to create new roles with color selection and permissions setup.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Renders the server settings layout with a sidebar to switch pages and loads the selected settings page.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users switch theme modes and adjust text scale using radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Loads and edits user profile fields, username, and account email, providing save actions for profile and username updates.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Renders the user settings layout with a sidebar for navigating profile and appearance settings and includes logout handling.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows connection status to the backend, including loading and error states with recovery instructions and a retry option.",
  "frontend/src/components/voice/StageView.tsx": "Renders a stage channel UI with static speaker and audience lists plus a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Displays a voice channel interface with participant lists, connection state, and join/leave handling tied to backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple disabled state and optional reason based on backend connection status.",
  "frontend/src/hooks/useBackendConnection.ts": "Tracks backend connection readiness by combining safe actor initialization with a minimal health check.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, logout, stored identity loading, and exposes identity state via context.",
  "frontend/src/hooks/useIsMobile.ts": "Detects whether the viewport width is below a breakpoint to determine mobile layout.",
  "frontend/src/hooks/useLogout.ts": "Logs the user out via the auth provider and clears all React Query cache.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend queries and mutations for profiles, usernames, servers, channels, and more with connection-aware error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes an authenticated or anonymous backend actor, handling retries and validating required methods.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines CSS variables for themes, global styles, and utility transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign-in and sign-up UI with validation, error handling, and tabbed forms.",
  "frontend/src/state/navigation.ts": "Provides navigation context managing views, server/channel selection, and UI state flags.",
  "frontend/src/state/notifications.ts": "Stores and retrieves notification overrides in localStorage and checks mute status for servers or channels.",
  "frontend/src/state/settings.ts": "Manages user settings such as theme, accent color, text scale, notifications, and keybinds with persistence.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces mirroring backend entities like servers, channels, roles, and audit logs.",
  "frontend/src/utils/channelOrdering.ts": "Applies and builds ordering for categories and channels based on persisted server ordering data.",
  "frontend/src/utils/hideElementByXPath.ts": "Provides utilities to remove a DOM element by XPath and monitor for re-insertion via MutationObserver.",
  "frontend/src/utils/roleColor.ts": "Provides functions to sanitize hex color strings and determine light/dark luminance for contrast selection.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin usage.",
  "project_state.json": "Project state metadata including issues, feature requests, and versioning info for Caffeine Chat."
}