{
  "backend/main.mo": "Defines the backend actor with authentication, user profiles, roles, servers, channels, messages, and audit log type definitions plus authorization mixin setup.",
  "backend/migration.mo": "Provides a migration module that passes old actor state through unchanged to the new actor structure.",
  "feature_evidence.json": "Feature evidence report mapping a specific admin-only replica reset feature to its related frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files describing app structure, hooks, UI components, and navigation logic.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles for the application.",
  "frontend/index.html": "Minimal HTML shell loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing auth flow, backend connection banner, theme/providers, and rendering the main UI shell.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication provider handling session restoration, backend validation, login/logout, and error states.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, validating, and clearing session data from localStorage.",
  "frontend/src/auth/useAuth.ts": "Hook exposing authentication context values from AuthProvider.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout wrapper for authentication screens with centered card UI, logo, title, and description.",
  "frontend/src/components/channels/CategorySection.tsx": "Handles category display, creation dialog, and drag-and-drop ordering for text and voice channels, updating server ordering via mutations.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Modal dialog allowing admins to create a new category with validation and backend action guarding.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Modal for creating text or voice channels under a category, supporting type selection and guarded backend submission.",
  "frontend/src/components/chat/ChatComposer.tsx": "Text input and action bar for composing and sending chat messages with backend validation and send shortcuts.",
  "frontend/src/components/chat/ChatView.tsx": "Displays channel messages with auto-scrolling, header controls, and a composer, fetching messages and channel names dynamically.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with avatar, author info lookup, timestamp formatting, and member-selection behavior.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Shows searchable list of community servers, filtering based on search queries and community mode.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Displays server preview info with join button and member count, using a join-server mutation.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the home DM view, switching to the friends view when the friends tab is selected, otherwise displaying an empty DM placeholder.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a row for a friend with avatar, name, status, quick action buttons, and a menu for profile or removal.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabbed friend management including online/all lists, pending requests with accept/decline, and a form to add friends by principal.",
  "frontend/src/components/layout/DesktopShell.tsx": "Defines the desktop layout with server rail, channel sidebar, main content, and optional member list panel.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses and renders the correct main view based on navigation state, including home, discovery, server channels, or settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Implements the mobile layout with sliding sheets for servers, channels, and members, plus a top bar and main content area.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells depending on screen width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Displays the member list for a server with avatars and usernames, handling loading and empty states.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Shows the server’s channel categories, supports category expansion, creation, admin-only drag ordering, and opening server settings.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Mobile top bar providing navigation buttons for servers, channels, members, and user settings, plus a title reflecting the current view.",
  "frontend/src/components/nav/ServerRail.tsx": "Sidebar showing home button, ordered server list, and create-server button with backend guard handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting user to enter a display name and saves the profile via mutation.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing a user's server roles with loading and pending state management.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Right-side overlay displaying a member’s profile, roles, and optional role-management dialog.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Form dialog for creating a new server with backend-guarded submission logic.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server’s icon with selection styling and optional click handling.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels within a selected category, handling form input, validation, and API mutations.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog allowing a channel to be moved to another category, filtering available categories and submitting a move mutation.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member and viewing or managing their assigned roles via a separate dialog.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays the server’s audit log with formatted event types and timestamps, handling loading and empty states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages listing and ordering of categories and channels, allowing reordering and opening a dialog to create new channels.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Page for editing server settings such as description, icon, banner, and community mode, with save functionality.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Displays a member selector and shows their assigned roles, with an option to open a dialog to manage roles.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Manages server roles, allowing creation of new roles and viewing existing ones along with a member-role assignment panel.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Shell UI for server settings with sidebar navigation and dynamic page rendering.",
  "frontend/src/components/settings/UserSettings/components/AdminReplicaResetSection.tsx": "Admin-only section for wiping local replica data with confirmation and verification UI.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users change theme preferences and adjust text scaling.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Allows users to edit profile details, username, and access admin replica reset tools if permitted.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Provides the layout and navigation for user settings, including profile, appearance, and logout actions.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows backend connection state with loading, error recovery instructions, and retry controls.",
  "frontend/src/components/voice/StageView.tsx": "Renders a stage channel UI showing static speaker and audience lists with avatars and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Displays a voice channel interface with participants, mute/deafen controls, and join/leave logic tied to backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple disabled/reason state based on backend connection status.",
  "frontend/src/hooks/useBackendConnection.ts": "Wraps useSafeActor to expose backend readiness, errors, and retry functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing identity, login, logout, and status tracking.",
  "frontend/src/hooks/useIsMobile.ts": "Returns a boolean indicating if the viewport width is below a given breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Clears user authentication and React Query cache when logging out.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for backend data fetching and mutations with friendly error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes an authenticated or anonymous backend actor with retry and error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for theming, including dark/light modes and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers.",
  "frontend/src/pages/LoginScreen.tsx": "Implements the login and registration UI with form handling, validation, and auth interactions.",
  "frontend/src/state/navigation.ts": "Provides a React context managing navigation state such as views, selections, and settings toggles.",
  "frontend/src/state/notifications.ts": "Handles localStorage-based notification override settings and mute checks for servers and channels.",
  "frontend/src/state/settings.ts": "Stores and updates app settings like theme, accent color, text scale, notifications, and keybinds using context.",
  "frontend/src/types/local.ts": "Contains frontend-only type definitions for servers, channels, roles, members, and related structures.",
  "frontend/src/utils/channelOrdering.ts": "Functions for applying, building, and merging ordering of categories and channels based on server data.",
  "frontend/src/utils/hideElementByXPath.ts": "Utility to find and remove a DOM element via XPath with an optional MutationObserver for continuous removal.",
  "frontend/src/utils/roleColor.ts": "Provides utilities to sanitize hex color strings and determine light/dark contrast for UI text.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the operation exceeds a given duration.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project state file defining features, requests, and metadata for the Server Chat project."
}