{
  "backend/main.mo": "Main actor implementing registration, user profiles, servers, and authorization with in‑memory maps and role checks.",
  "backend/migration.mo": "Migration module defining old/new userProfiles shapes and returning an empty new map.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs for two backend‑related features.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing UI, state, and query logic.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point mounting the app root and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app that handles auth state, profile setup flow, layout rendering, and global providers.",
  "frontend/src/auth/authMessages.ts": "Defines auth message constants and provides functions to sanitize and categorize backend error messages by flow.",
  "frontend/src/auth/AuthProvider.tsx": "Auth context handling session restore, backend register/login calls, error mapping, and connection state.",
  "frontend/src/auth/sessionStorage.ts": "Manages saving, loading, validating, and clearing auth session data in localStorage with expiration handling.",
  "frontend/src/auth/useAuth.ts": "Exports a hook that returns the authentication context for consumer components.",
  "frontend/src/components/auth/AuthLayout.tsx": "Provides a centered layout wrapper with branding for authentication-related pages.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a collapsible channel category with drag-and-drop ordering and admin-only channel management actions.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Modal dialog for creating a new channel category with backend validation and error display.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Modal dialog for creating text or voice channels within a category, handling mutations and backend restrictions.",
  "frontend/src/components/chat/ChatComposer.tsx": "Text input component for composing and sending chat messages with backend readiness checks and send shortcuts.",
  "frontend/src/components/chat/ChatView.tsx": "Displays text channel messages, handles auto-scrolling, empty states, and renders a composer for sending new messages.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders an individual chat message with avatar, username, timestamp, and profile navigation.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Shows a searchable list of public servers and allows users to join them.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Displays a preview card for a server with name, description, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home screen or friends view, with an empty state for no messages.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend entry with avatar, status, and action buttons like message or call.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for viewing friends, pending requests, and adding new friends with request actions.",
  "frontend/src/components/layout/DesktopShell.tsx": "Desktop layout combining server rail, channel sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses and renders the correct main view based on navigation state, including chat, DMs, discovery, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout using slide-out sheets for servers, channels, and members, with top bar navigation.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between desktop and mobile layouts based on window width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Displays a scrollable list of server members, rendering each with an avatar and allowing member selection. Fetches member and profile data and shows a loading state until ready.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Shows server info, categories, and channels with loading states and admin controls. Allows category expansion, channel selection, and opening server settings.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Renders the mobile top bar with menu buttons and a dynamic title based on navigation state. Displays channel or server info and provides a members button in server view.",
  "frontend/src/components/nav/ServerRail.tsx": "Provides a vertical server navigation rail with home, server list, create server, and discovery actions. Supports tooltips, loading states, and server selection.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for first‑time profile setup that pre-fills and saves the user’s display name. Handles loading, input, and submission states.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog to assign or remove roles for a server member with per-role pending states. Fetches roles, toggles assignments, and displays role colors.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Displays a user profile sidebar overlay with avatar, banner, roles, and profile info, fetched via queries. Allows admins to open a role assignment dialog.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Provides a dialog for creating a new server with name and optional description, handling backend state and mutation errors.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server’s icon image or a fallback initial-based icon if no custom icon is set.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels within a selected category, including backend validation and mutation handling.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog for admins to move a channel to a different category, listing available destinations.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a member, viewing their roles, and opening a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays a server's audit log with sorting, formatting, and error/loading states. Fetches audit entries and renders them in a scrollable list.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages channel categories and channel ordering within a server. Allows admins to move channels up/down and create new channels.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Provides editable server settings such as name, description, banner, icon, and community mode. Loads server data and updates settings via mutations.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Lets admins select members and manage their assigned roles through a dialog. Displays current roles with color badges.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Allows creation of new roles with names and colors and lists existing roles. Also includes role assignment panel integration.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Hosts the server settings UI with a sidebar for switching between pages and renders the selected settings page content.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "UI page for selecting theme (dark/light/system) and adjusting text scale using radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Profile settings page that loads and edits user profile fields and username with save actions and loading states.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Container for user settings UI with navigation between profile and appearance pages. Handles logout and sidebar navigation.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Banner component showing backend connection status with loading, error instructions, and retry support.",
  "frontend/src/components/voice/StageView.tsx": "Static stage channel layout displaying speaker and audience avatars with a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Voice channel view handling join/leave actions, mute/deafen state, and listing current participants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Hook that disables backend actions when the backend connection is loading or in an error state.",
  "frontend/src/hooks/useBackendConnection.ts": "Tracks backend connection readiness using actor initialization and a simple health query with retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication, login state, and loading stored identities.",
  "frontend/src/hooks/useIsMobile.ts": "Provides a hook that tracks whether the viewport width is below a given breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Implements logout logic by calling the auth provider and clearing React Query cache.",
  "frontend/src/hooks/useQueries.ts": "Contains multiple React Query hooks for user profiles and backend interactions with friendly error handling and mock implementations.",
  "frontend/src/hooks/useSafeActor.ts": "Initializes and validates a backend actor, exposing state and retry logic for missing methods or errors.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for theming, including dark/light modes and utility styles.",
  "frontend/src/main.tsx": "Sets up the React app root with QueryClient and InternetIdentity providers before rendering App.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign‑in and sign‑up forms with validation, tab switching, and auth error handling.",
  "frontend/src/state/navigation.ts": "Manages navigation state for views, servers, channels, and settings via a React context provider.",
  "frontend/src/state/notifications.ts": "Handles notification override storage and lookup for muted servers and channels using localStorage.",
  "frontend/src/state/settings.ts": "Provides a settings context storing theme, UI preferences, and keybinds with persistence to localStorage.",
  "frontend/src/types/backend-extended.ts": "Defines extended frontend TypeScript interfaces mirroring backend data structures plus helpers like category conversion.",
  "frontend/src/utils/channelOrdering.ts": "Provides utilities to merge and apply channel and category ordering, and to build ordering metadata.",
  "frontend/src/utils/hideElementByXPath.ts": "Removes a specific DOM element by XPath and sets up a MutationObserver for continuous removal.",
  "frontend/src/utils/roleColor.ts": "Validates hex color values and computes contrast and luminance helpers for role colors.",
  "frontend/src/utils/urlParams.ts": "Handles URL and sessionStorage parameter extraction, persistence, and cleanup for routing state.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if it exceeds a specified duration.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugins.",
  "project_state.json": "Tracks project metadata, known issues, and pending feature requests related to backend registration functionality."
}