{
  "backend/main.mo": "Backend actor managing user registration, login, credential storage, profile creation, and role assignment with sanitization and error handling.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, hooks, state providers, and UI modules.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component controlling auth flow, profile setup, theming, navigation, and global UI wrappers.",
  "frontend/src/auth/authMessages.ts": "Centralized auth-related messages with utilities for sanitizing, categorizing, and mapping backend errors.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication context managing session restore, login, registration, logout, and backend connection handling.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, and clearing auth session data in localStorage with expiration handling and type normalization.",
  "frontend/src/auth/useAuth.ts": "Thin wrapper re-exporting the auth context hook for easier consumption.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout component providing a centered auth page shell with title, description, and logo.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a channel category with drag-and-drop channel ordering, admin-only actions, and channel creation dialog support.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating a new channel category with backend validation and error handling.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels within a category, including type selection and backend status checks.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer for text channels supporting send actions, enter-to-send, and backend readiness checks.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected channel with auto-scroll, empty states, and integrated composer.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a chat message with avatar, author info, timestamp, and click-to-view profile behavior.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Displays a searchable list of community servers and lets users join them.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Shows a server preview card with name, description, member count, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the direct messages home view or switches to the friends view depending on navigation state.",
  "frontend/src/components/friends/FriendRow.tsx": "Displays a single friend entry with avatar, name, status, and quick action buttons.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for viewing friends, requests, and adding friends, with actions for managing friend requests.",
  "frontend/src/components/layout/DesktopShell.tsx": "Lays out the desktop interface with server rail, channel sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses and renders the appropriate main view based on navigation state, including chat, DMs, discovery, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Implements the mobile layout using sheets for servers, channels, and members with a top bar and content area.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between desktop and mobile shells based on window size.",
  "frontend/src/components/members/MemberListPanel.tsx": "Shows a server’s member list and allows selecting a member, with each row displaying avatar and name.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Displays server channel categories with drag-and-drop reordering and category creation. Integrates navigation state, server data, and ordering persistence.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Renders a mobile top bar with navigation buttons and current view title. Allows opening servers, channels, members, and user settings.",
  "frontend/src/components/nav/ServerRail.tsx": "Shows a vertical sidebar of servers with ordering, home navigation, and server creation. Highlights the selected server and supports backend action restrictions.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new users to set a display name and submit an initial profile. Handles profile creation with loading state.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing user roles in a server with pending-change tracking. Lists roles and updates assignments via mutations.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Displays a user's profile with avatar, banner, roles, and metadata, plus role management if permitted. Opens when a member is selected and supports closing and role editing.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and description fields. Handles form submission, validation, backend restrictions, and reset on close.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server icon image if available, otherwise shows a fallback block with the server's initial.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels, handling form input, category selection, and channel creation mutations.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog allowing users to move a channel to another category, validating selection and triggering a move callback.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel to select a server member, view their roles, and open a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays the server audit log with formatted events, timestamps, and error/loading states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages categories and channels with ordering logic, admin-only move actions, and a dialog to create new channels.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Provides a server overview settings form allowing edits to description, banner/icon URLs, and community mode, with save support via mutation hooks.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Displays server members, lets the user select one, view their roles, and open a dialog to manage role assignments.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Allows creating new roles with names and colors and lists existing roles, integrating role creation mutations and role data loading.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Provides the main layout and navigation for server settings, switching between settings pages and handling close behavior.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users change theme mode and text scale using radio buttons and a slider tied to settings state.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Displays and edits user profile fields, username, and account email using query and mutation hooks with save actions.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Provides the layout and navigation shell for user settings, switching between profile and appearance pages and supporting logout.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows connection status to the backend with loading, error, or hidden states, including recovery steps and retry action.",
  "frontend/src/components/voice/StageView.tsx": "Displays a stage view with hardcoded speakers and audience lists, rendering avatars and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Shows participants in a selected voice channel, handles join/leave logic, and manages mute/deafen states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple guard indicating whether backend actions should be disabled based on connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Determines backend connection readiness by combining safe actor initialization with a lightweight health check.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, loading, login, and identity management.",
  "frontend/src/hooks/useIsMobile.ts": "Tracks window size to determine if the viewport is considered mobile.",
  "frontend/src/hooks/useLogout.ts": "Handles logout by clearing auth state and flushing the React Query cache.",
  "frontend/src/hooks/useQueries.ts": "Defines many data-fetching and mutation hooks for interacting with backend user, server, and voice-channel APIs using React Query.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes a backend actor with optional identity and retry support, handling errors and access control setup gracefully.",
  "frontend/src/index.css": "Defines Tailwind layers plus CSS variables for dark and light themes and basic global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign‑in and sign‑up forms with validation, tab switching, and error handling using the auth context.",
  "frontend/src/state/navigation.ts": "Provides navigation context for tracking views, selected server/channel, tabs, and settings panels.",
  "frontend/src/state/notifications.ts": "Manages per‑server and per‑channel notification overrides persisted in localStorage.",
  "frontend/src/state/settings.ts": "Stores and updates UI settings such as theme, accent color, text scale, notifications, and keybinds with persistence.",
  "frontend/src/types/backend-extended.ts": "Contains extended TypeScript interfaces matching backend structures like servers, channels, messages, and roles.",
  "frontend/src/utils/channelOrdering.ts": "Utilities for applying and generating channel and category ordering based on persisted server ordering data.",
  "frontend/src/utils/hideElementByXPath.ts": "Functions to remove a DOM element via XPath and observe for reinsertions to keep it hidden.",
  "frontend/src/utils/roleColor.ts": "Provides utilities to sanitize hex role colors, detect lightness, and choose a contrasting text color.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters and session-backed parameters.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it doesn't resolve within the given duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, breakpoints, and plugins.",
  "project_state.json": "JSON describing current project state, known issues, and role-assignment fix requirements for registration."
}