{
  "backend/main.mo": "Defines actor state, authorization mixin, and all shared types for users, roles, servers, channels, messages, audit logs, and comparisons.",
  "backend/migration.mo": "Provides a no‑op migration function returning the input state unchanged.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of various frontend files.",
  "frontend/index.css": "Tailwind base and theme CSS defining light/dark variables and global styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app managing auth, profile setup, theme, providers, and rendering the main shell.",
  "frontend/src/components/channels/CategorySection.tsx": "UI component rendering a collapsible channel category with text/voice channels and a dialog to create new channels.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Modal form to create a new category in a server, handling backend guard and mutation state.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels within a category, with type selection and mutation handling.",
  "frontend/src/components/chat/ChatComposer.tsx": "Input composer for sending text messages with backend guard and keyboard shortcuts.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected channel, auto-scrolls, and includes the message composer.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with avatar, timestamp, and role-colored username.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Server discovery page with search filtering and join actions for community servers.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Card showing a server preview with name, description, member count, and join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Direct messages home view showing either friends or an empty DM state.",
  "frontend/src/components/friends/FriendRow.tsx": "Row component displaying a friend's profile, status, and quick action buttons.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Renders the friends page with tabs for online, all, pending, blocked, and add friend, including friend request actions.",
  "frontend/src/components/layout/DesktopShell.tsx": "Desktop layout wrapper that arranges server rail, channel sidebar, main content, and optional member list panel.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which main view to display based on navigation state, including DMs, servers, discovery, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout with slide-out sheets for servers, channels, members, and access to user settings.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells based on window width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Displays a scrollable list of server members with avatars, usernames, and role-colored names.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Shows the home or server channel sidebar, listing categories, channels, and settings options.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Mobile top bar providing navigation buttons, server or view title, and quick access to settings.",
  "frontend/src/components/nav/ServerRail.tsx": "Vertical server list with home button, ordered servers, and a button to create new servers.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog that collects a display name and saves a new user profile before continuing.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "UI for assigning or removing server roles from a user with pending-change tracking.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Profile overlay showing user info, roles, and administrative actions like role management.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Form dialog to create a new server with name and optional description, respecting backend restrictions.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server's icon or a fallback initial if none exists.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog to create a text or voice channel within a specified server category.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog for selecting a new category and moving a text or voice channel to it.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays a sortable audit log of server events with formatted timestamps and principals.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages categories and channels, including creation, ordering, and moving channels between categories.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Server settings page allowing updates to description, media URLs, and community mode.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Lists roles and provides a dialog to create new roles with configurable permissions and color.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Container for server settings pages, providing navigation and section rendering.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Allows users to change theme and adjust text scaling.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Form page allowing users to view and update their profile fields and username via backend mutation hooks.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Shell UI for user settings with navigation between profile, appearance, and logout.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Empty placeholder component; contains no implementation.",
  "frontend/src/components/voice/StageView.tsx": "Displays speakers and audience for a stage channel with basic UI and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Voice channel interface showing participants, connection state, join/leave actions, and mute/deafen controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple disabled/reason guard based on backend connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Establishes and monitors backend actor health, exposing connection state, errors, and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, persistence, and identity state.",
  "frontend/src/hooks/useIsMobile.ts": "Tracks whether the viewport width is below a given breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Clears the user's identity and resets all cached queries on logout.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user, username, and profile data with backend connection and error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Creates and manages a backend actor instance with authentication, retries, and non-fatal access control initialization.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, base styles, and utility classes for the app.",
  "frontend/src/main.tsx": "App entry point setting up React, query client provider, and Internet Identity provider.",
  "frontend/src/pages/LoginScreen.tsx": "Login UI allowing users to authenticate with Internet Identity and displaying errors or loading states.",
  "frontend/src/state/navigation.ts": "Provides navigation context for tracking current view, server, channel, and UI panels with update helpers.",
  "frontend/src/state/notifications.ts": "Manages notification overrides in localStorage and checks whether servers or channels are muted.",
  "frontend/src/state/settings.ts": "Settings context storing theme, accent colors, text scale, notification prefs, and keybinds with persistence.",
  "frontend/src/utils/roleColor.ts": "Utility functions to sanitize role colors and compute contrast and lightness for styling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing) and store/retrieve them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, custom colors, container settings, animations, and extended theme values.",
  "project_state.json": "Describes current project state, existing features, and pending requests related to server roles, role display, assignment, and username color behavior."
}