{
  "backend/main.mo": "Motoko actor handling user registration, login, session creation, and profile initialization with access control and in-memory stores for credentials and sessions.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to map backend registration errors to friendly messages with related files and components.",
  "frontend-file-summaries.txt": "Prewritten set of summaries for multiple frontend files covering app structure, state providers, navigation, queries, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration defining light/dark theme CSS variables and applying base styles across the app.",
  "frontend/index.html": "HTML entry point mounting the React application and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, profile setup, layout providers, and global connection banner.",
  "frontend/src/auth/authMessages.ts": "Centralized authentication messages and a function mapping backend registration errors to user-facing text.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication context managing session restoration, login, registration, logout, and backend session validation.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, and clearing auth session data in localStorage with expiration handling and type normalization.",
  "frontend/src/auth/useAuth.ts": "Exports a hook that returns authentication context values.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout component that renders a styled authentication page wrapper with logo, title, description, and children.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a category section with channel lists, drag-and-drop reordering, and channel creation controls tied to server ordering.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating a new category with validation, backend-guard checks, and mutation error handling.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels within a category, supporting type selection and guarded backend actions.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input component that sends text channel messages with backend validation and UI controls.",
  "frontend/src/components/chat/ChatView.tsx": "Displays channel messages, handles auto-scrolling, and shows a composer for sending new messages.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders an individual chat message with avatar, username, timestamp, and click-to-view-profile behavior.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Displays a searchable list of community servers and allows joining them.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Shows a server preview card with name, description, member count, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home view or friends view, and a placeholder when no DMs exist.",
  "frontend/src/components/friends/FriendRow.tsx": "Displays a friend entry with avatar, status, and actions like message, call, or menu options.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for managing friends, requests, blocks, and adding friends.",
  "frontend/src/components/layout/DesktopShell.tsx": "Defines the desktop layout with server rail, channel sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which major view to display based on navigation state such as DMs, server channels, or settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Implements the mobile layout using slide-out sheets for servers, channels, and members.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shells based on window size.",
  "frontend/src/components/members/MemberListPanel.tsx": "Lists server members with avatars and lets the user select a member for more details.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Renders the server's channel sidebar, handles category expansion, drag-and-drop reordering, and category creation dialog.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Provides a mobile top navigation bar with server, channel, member, and settings actions.",
  "frontend/src/components/nav/ServerRail.tsx": "Displays the vertical server list rail, including server ordering, navigation, and server creation dialog.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog for first‑time profile setup allowing the user to enter and save a display name.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog to assign or remove roles for a server member with pending‑state handling.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Full user profile overlay showing avatar, banner, details, roles, and role‑management options.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and description fields and backend‑guard checks.",
  "frontend/src/components/servers/ServerIcon.tsx": "Displays a server icon image if available or a fallback with the server's initial.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels, handling form input, category selection, and mutation states.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog allowing users to move a channel to another category with validation and pending state handling.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member and managing their assigned roles with a role assignment dialog.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Fetches and displays audit log entries with formatted timestamps, event types, and user IDs.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Displays categories and channels with ordering controls, supports moving channels and creating new ones.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Form for viewing and updating basic server settings like description, media URLs, and community mode.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Allows selecting a server member and managing their assigned roles via a role management dialog.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Provides UI to create new roles and list existing ones, including color and permissions setup.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Provides the layout and navigation shell for server settings pages with a sidebar and dynamic content area.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users adjust theme mode and text scaling preferences.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Manages updating user profile fields, avatar/banner URLs, and username.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Container for user settings pages with navigation, logout handling, and page rendering.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Displays backend connection status with loading, error guidance, and retry controls.",
  "frontend/src/components/voice/StageView.tsx": "Displays a stage channel layout with hardcoded speakers and audience and a raise-hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Manages voice channel connection state, renders participants, and provides controls for joining, leaving, and muting.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple disabled/reason status based on backend connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Tracks backend readiness using useSafeActor and a lightweight health check and exposes connection status and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, identity loading, login, and logout state.",
  "frontend/src/hooks/useIsMobile.ts": "Returns a boolean indicating if the viewport width is below a given breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Logs the user out and clears React Query cache.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous backend query and mutation hooks for profiles, usernames, server data, messages, and voice presence with error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Initializes an authenticated or anonymous backend actor with retries and validation, exposing its state and errors.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light and dark modes, and global styles including focus and transition utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/LoginScreen.tsx": "Implements a signup/signin UI with form validation and authentication handling using useAuth.",
  "frontend/src/state/navigation.ts": "Provides context and state management for app navigation, selected server/channel, and settings visibility.",
  "frontend/src/state/notifications.ts": "Manages notification override settings in localStorage and helpers to check server or channel mute status.",
  "frontend/src/state/settings.ts": "Stores user settings such as theme, accent color, notifications, and keybinds with persistence to localStorage.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces for backend entities like servers, channels, roles, and audit logs.",
  "frontend/src/utils/channelOrdering.ts": "Utilities to apply and build channel and category ordering based on persisted ServerOrdering data.",
  "frontend/src/utils/hideElementByXPath.ts": "Provides functions to remove a DOM element by XPath and set up a MutationObserver for continuous removal.",
  "frontend/src/utils/roleColor.ts": "Provides utilities to sanitize hex color strings and compute lightness or contrast colors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if it does not resolve in time.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing current issues, feature requests, and registration error investigation."
}