{
  "backend/main.mo": "Defines the backend actor with authorization mixin and all core types for users, sessions, servers, channels, roles, messages, and audit logs.",
  "feature_evidence.json": "Lists implemented features with evidence, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten short summaries of numerous frontend files describing UI and logic responsibilities.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main UI flow deciding between loading, login, or authenticated layout while rendering global providers and connection banner.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication context handling session restoration, validation, login, logout, and backend connection failures with initialization timeout.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, validating, and clearing persisted auth session data.",
  "frontend/src/auth/useAuth.ts": "Simple hook exposing the AuthProvider context.",
  "frontend/src/components/auth/AuthLayout.tsx": "Provides a centered auth page layout with logo, title, optional description, and child content.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a category with text/voice channels, drag-and-drop ordering, and an optional create-channel dialog.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating a new channel category with validation and backend action guarding.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels in a category with type selection and backend checks.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer for sending text channel messages with send button, shortcuts, and backend validation.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected text channel with auto-scroll and an input composer.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with avatar, author info, timestamp, and role-based color styling.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Server discovery UI that filters community servers by search and supports joining them.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Displays a server preview card with name, description, member count, and a join button.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the DM home screen or friends list based on navigation, with an empty state for no DMs.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend's avatar, name, status, and action buttons including messaging and dropdown options.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Provides tabs for managing friends, pending requests, and adding new friends using principal IDs.",
  "frontend/src/components/layout/DesktopShell.tsx": "Desktop layout wrapping server rail, channel sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which main view to show based on navigation state, including chat, DMs, discovery, and settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout using sliding sheets for servers, channels, and members, with main content and top bar.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop layouts based on screen width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Shows a scrollable list of server members with avatars, usernames, and role-colored display names.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Displays server categories and channels with admin reordering, expansion state, and server settings access.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Top bar for mobile navigation with buttons for servers, channels, members, and user settings.",
  "frontend/src/components/nav/ServerRail.tsx": "Renders the left-side server rail with home navigation, ordered server icons, and a button to create servers, using navigation and backend guard state.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Provides a dialog for first‑time profile setup, allowing the user to enter a display name and submit it via a mutation.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Displays and manages role assignments for a server member, supporting toggling roles with pending-state handling.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Shows a full user profile overlay with avatar, banner, details, roles, and optional role‑management controls.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name and description inputs, integrating backend action guards and mutation handling.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server's icon or a fallback initial inside a styled square used in the server list.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog component for creating text or voice channels, handling form inputs, category selection, and mutation calls.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog allowing users to move a channel to another category, showing available targets and triggering a move callback.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member, viewing their roles, and opening a dialog to manage assigned roles.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays server audit log entries with formatted metadata and sorting, handling loading and empty states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Manages server channel ordering, movement, and creation dialogs using persisted ordering and admin permissions.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Page for editing server settings like description, icon, banner, and community mode, with save functionality.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "UI panel for selecting a server member and viewing/managing their assigned roles, including opening a role assignment dialog.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Displays server roles, allows creating new roles with permissions, and includes a panel to assign roles to members.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Main layout for server settings with a sidebar for page selection and dynamic content rendering for settings pages.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Lets users change UI theme and adjust text scale via radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Profile editing page allowing users to update personal details, username, and view account email.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Main container for user settings, handling navigation between profile and appearance pages and providing logout functionality.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows connection status to the backend with loading, error, and retry instructions.",
  "frontend/src/components/voice/StageView.tsx": "Static stage channel view displaying speakers, audience members, and a Raise Hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Renders a voice channel UI showing participants, connection status, and join/leave controls using backend voice hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Provides a simple guard indicating whether backend actions should be disabled based on connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Validates backend connectivity by combining safe actor initialization with a health check and exposes connection status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication state, login, logout, and identity persistence via an auth client.",
  "frontend/src/hooks/useIsMobile.ts": "Tracks whether the viewport width is below a given breakpoint to detect mobile layout.",
  "frontend/src/hooks/useLogout.ts": "Logs the user out through the auth provider and clears all React Query cache.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous typed backend data queries and mutations with error handling and cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes an authenticated or anonymous backend actor with retry logic and non-fatal access control setup.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, light mode, global styles, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/pages/LoginScreen.tsx": "Implements a login and registration screen with form state, validation, and error handling using the useAuth hook.",
  "frontend/src/state/navigation.ts": "Provides a navigation context managing current view, selected server/channel, UI panels, and related setters.",
  "frontend/src/state/notifications.ts": "Manages notification override settings in localStorage and checks mute status for servers and channels.",
  "frontend/src/state/settings.ts": "Provides a settings context with theme, UI, notification, and keybind preferences persisted in localStorage.",
  "frontend/src/utils/channelOrdering.ts": "Utilities to merge, apply, and build channel and category ordering from server data and persisted settings.",
  "frontend/src/utils/hideElementByXPath.ts": "Removes a specific DOM element by XPath and sets up a mutation observer to keep it removed.",
  "frontend/src/utils/roleColor.ts": "Validates and sanitizes hex colors and provides contrast calculations for role color styling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it does not resolve in the specified time.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and loading typography, container-queries, and animate plugins.",
  "project_state.json": "Project metadata describing current state, known issues, and implemented features for handling app loading and backend connection behavior."
}