{
  "backend/main.mo": "Defines the main actor with access control mixin, user/session types, server/channel/message structures, and comparison helpers.",
  "backend/migration.mo": "Provides a no-op migration module returning an empty new actor state.",
  "feature_evidence.json": "Lists feature evidence entries mapping frontend files to authentication and session-related requirements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for documentation or tooling.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Minimal HTML shell loading the main React entrypoint.",
  "frontend/src/App.tsx": "Root app component wiring authentication, profile setup flow, theming, navigation, and responsive shell rendering.",
  "frontend/src/auth/AuthProvider.tsx": "Implements authentication context with session restore, backend session validation, and login/register placeholders.",
  "frontend/src/auth/sessionStorage.ts": "Utility for persisting, loading, validating, and clearing session data in localStorage.",
  "frontend/src/auth/useAuth.ts": "Convenience hook exposing the authentication context.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout wrapper for auth-related pages with centered card design and logo.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a collapsible category showing its text and voice channels and includes a dialog for creating new channels.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Provides a dialog form to create a new channel category on a server with backend validation and guarded submission.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels within a category, handling type selection and backend‑guarded submission.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input box for sending text messages to the selected channel with backend state handling and send button controls.",
  "frontend/src/components/chat/ChatView.tsx": "Displays messages for the selected text channel with auto‑scrolling and includes the message composer at the bottom.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with avatar, author info, timestamp, role‑colored name, and selectable member profile.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Shows discoverable community servers with search filtering and allows users to join a server.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Card component displaying a server’s basic info, member count, and a button to join the server.",
  "frontend/src/components/dms/DMHomeView.tsx": "Switches between friends view and a placeholder DM home screen based on navigation state.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend's avatar, name, status, and action buttons using fetched profile data.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Displays friend lists, pending requests, and an add‑friend form using query hooks and tabs.",
  "frontend/src/components/layout/DesktopShell.tsx": "Desktop layout that shows server rail, sidebar, main content, and member list based on navigation state.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which main view to render—DMs, discovery, chat, voice, stage, or settings—according to navigation state.",
  "frontend/src/components/layout/MobileShell.tsx": "Mobile layout using sliding sheets for servers, channels, and members, with main content centered.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Selects mobile or desktop shell depending on window width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Shows a scrollable list of server members with avatars, colors, and click handling.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Sidebar showing DM tabs in home view or server categories and settings in server view.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Top bar for mobile that provides navigation buttons and shows current view title.",
  "frontend/src/components/nav/ServerRail.tsx": "Displays a vertical server navigation bar with home, server list, and create-server controls, using ordering and navigation state.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal dialog for initial profile setup allowing the user to enter a display name and create their profile.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing roles from a user, handling pending mutations and displaying available roles.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Overlay showing a user's profile, roles, badges, and actions, with support for opening role management.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Modal dialog for creating a new server with name and description fields, respecting backend action restrictions.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server's icon image or a fallback initial if no custom icon exists.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog component for creating text or voice channels within a server, handling category selection, form state, and mutation calls.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog for moving a channel to another category, filtering available categories and triggering a move callback.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting a server member and managing their assigned roles, including viewing current roles and opening a role assignment dialog.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Page that fetches, formats, sorts, and displays audit log entries for a server with loading and error states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Page for viewing and managing server categories and channels, including creation dialogs, move dialogs, and ordered channel/category rendering.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Page for editing basic server settings such as description, icon, banner, and community mode, with save mutation handling.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "UI panel to select a server member and view or manage their assigned roles, including opening a role assignment dialog.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Displays roles in a server and provides UI to create new roles and assign them to members via the RoleMemberAssignmentPanel.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Container for server settings with a sidebar of pages and dynamic rendering of the selected settings page.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Allows users to change theme settings and adjust text scale using radio buttons and a slider.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Loads and edits the user's profile, username, and account info with save actions for profile and username changes.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Container for user settings with navigation between profile and appearance pages and a logout option.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Empty placeholder component file for backend connection status banner.",
  "frontend/src/components/voice/StageView.tsx": "Static stage channel view showing example speakers, audience members, and a raise hand button.",
  "frontend/src/components/voice/VoiceView.tsx": "Voice channel interface enabling join/leave actions, mute/deafen toggles, and displaying live participant lists.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Determines whether backend actions should be disabled based on backend connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Establishes backend readiness by combining actor initialization with a health check and exposes connection status helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity initialization via AuthClient.",
  "frontend/src/hooks/useIsMobile.ts": "Returns whether the viewport width is below a specified breakpoint.",
  "frontend/src/hooks/useLogout.ts": "Performs logout through the auth provider and clears all React Query cache.",
  "frontend/src/hooks/useQueries.ts": "Provides typed React Query hooks for fetching and mutating user, server, and messaging data via the backend actor with friendly error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes an authenticated or anonymous backend actor with retry support and non-fatal access control setup.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, theme variables, light/dark modes, and base UI styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering the root App component.",
  "frontend/src/pages/LoginScreen.tsx": "Implements sign-in and sign-up forms with validation, error handling, and integration with the auth system.",
  "frontend/src/state/navigation.ts": "Provides a React context managing navigation state such as current view, selected server/channel, UI panes, and category expansion.",
  "frontend/src/state/notifications.ts": "Manages per-server and per-channel notification overrides using localStorage with helpers for muting checks.",
  "frontend/src/state/settings.ts": "Implements a React context for user settings including theme, accent color, text scale, notifications, and keybinds persisted in localStorage.",
  "frontend/src/utils/hideElementByXPath.ts": "Removes a specific button via XPath and provides a MutationObserver helper to keep it removed.",
  "frontend/src/utils/roleColor.ts": "Sanitizes role color hex values and computes contrast and luminance for readable text on colored backgrounds.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL params, storing them in sessionStorage, and managing persisted parameters for routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Defines project metadata, known issues, and feature requests related to authentication and session handling."
}