{
  "backend/main.mo": "Actor handling user registration, login, session creation, and profile initialization with access control and multiple credential indexes.",
  "backend/migration.mo": "Migration module adding a credentialsByPrincipal index by deriving it from existing username-based credentials.",
  "feature_evidence.json": "Feature evidence report linking a frontend registration error‑messaging update to affected files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their purposes and behaviors.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app handling auth state, profile setup, theme/providers, and rendering the responsive shell.",
  "frontend/src/auth/authMessages.ts": "Centralized auth messaging, error categorization, and backend-to-frontend registration error mapping utilities.",
  "frontend/src/auth/AuthProvider.tsx": "Authentication context managing session initialization, login, registration, logout, and backend session validation.",
  "frontend/src/auth/sessionStorage.ts": "Utility for saving, loading, and clearing auth session data in localStorage with expiration handling and type normalization.",
  "frontend/src/auth/useAuth.ts": "Re-exports the auth context hook for accessing auth state.",
  "frontend/src/components/auth/AuthLayout.tsx": "Layout component for authentication pages with logo, title, optional description, and centered content container.",
  "frontend/src/components/channels/CategorySection.tsx": "Renders a channel category with admin drag-and-drop reordering for text and voice channels and a dialog to create new channels.",
  "frontend/src/components/channels/CreateCategoryDialog.tsx": "Dialog for creating a new server category with validation, mutation handling, and backend action guards.",
  "frontend/src/components/channels/CreateChannelDialog.tsx": "Dialog for creating text or voice channels in a category with type selection, mutation logic, and backend guards.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message composer for text channels supporting send actions, enter-to-send, disabled states, and backend guards.",
  "frontend/src/components/chat/ChatView.tsx": "Chat view showing messages for the selected channel with auto-scroll, loading states, and a composer at the bottom.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders an individual chat message with avatar, author info, timestamp, and content, enabling profile selection on click.",
  "frontend/src/components/discovery/DiscoveryView.tsx": "Displays community servers with search filtering and join actions in a discovery interface.",
  "frontend/src/components/discovery/ServerPreviewCard.tsx": "Shows a server preview card with name, description, member count, and a button to join.",
  "frontend/src/components/dms/DMHomeView.tsx": "Shows the direct messages home view or friends list depending on navigation state, with an empty-state message.",
  "frontend/src/components/friends/FriendRow.tsx": "Renders a friend's avatar, name, status, and action buttons including messaging, calling, and options menu.",
  "frontend/src/components/friends/FriendsHomeView.tsx": "Manages friend lists, pending requests, and adding friends using tabs and related actions.",
  "frontend/src/components/layout/DesktopShell.tsx": "Layouts the desktop app shell including server rail, channel sidebar, main content, and optional member list.",
  "frontend/src/components/layout/MainContent.tsx": "Chooses which main view to render based on navigation state such as DMs, discovery, server channels, or settings.",
  "frontend/src/components/layout/MobileShell.tsx": "Provides the mobile app layout with slide-in panels for servers, channels, members, and settings.",
  "frontend/src/components/layout/ResponsiveShell.tsx": "Switches between mobile and desktop shell layouts based on screen width.",
  "frontend/src/components/members/MemberListPanel.tsx": "Displays a scrollable list of server members with avatars and names, allowing selection of a member.",
  "frontend/src/components/nav/ChannelSidebar.tsx": "Sidebar showing server categories and channels with drag-and-drop reordering and category creation support.",
  "frontend/src/components/nav/MobileTopBar.tsx": "Mobile top bar providing navigation buttons and context‑aware server or home titles.",
  "frontend/src/components/nav/ServerRail.tsx": "Left-side server list rail with ordered servers, home button, and server creation entry.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new users to set their display name and create their profile.",
  "frontend/src/components/profile/RoleAssignmentDialog.tsx": "Dialog for assigning or removing server roles for a member with pending‑change handling.",
  "frontend/src/components/profile/UserProfileOverlay.tsx": "Overlay showing a member's profile, roles, and actions like role management if permitted.",
  "frontend/src/components/servers/CreateServerDialog.tsx": "Dialog for creating a new server with name, description, and backend action safety checks.",
  "frontend/src/components/servers/ServerIcon.tsx": "Renders a server icon image if available or a fallback with the server's initial.",
  "frontend/src/components/settings/ServerSettings/components/CreateChannelInSettingsDialog.tsx": "Dialog for creating text or voice channels, handling category selection and mutations.",
  "frontend/src/components/settings/ServerSettings/components/MoveChannelDialog.tsx": "Dialog to move a channel to another category with validation and loading states.",
  "frontend/src/components/settings/ServerSettings/components/RoleMemberAssignmentPanel.tsx": "Panel for selecting members and viewing or editing their assigned roles in a server.",
  "frontend/src/components/settings/ServerSettings/pages/AuditLogPage.tsx": "Displays sorted server audit log entries with formatted event details and loading states.",
  "frontend/src/components/settings/ServerSettings/pages/ChannelsPage.tsx": "Shows categories and channels with ordering controls and supports channel creation and reordering.",
  "frontend/src/components/settings/ServerSettings/pages/OverviewPage.tsx": "Provides a form to view and update server settings like description, banner, icon, and community mode. Fetches server data and saves updates via mutation.",
  "frontend/src/components/settings/ServerSettings/pages/RoleMemberAssignmentPanel.tsx": "Lets admins select a server member, view their roles, and open a dialog to manage assignments. Loads members and roles, showing badges for current roles.",
  "frontend/src/components/settings/ServerSettings/pages/RolesPage.tsx": "Displays existing roles and allows creating new roles with name and color. Uses queries and mutations to manage role data for the selected server.",
  "frontend/src/components/settings/ServerSettings/ServerSettingsShell.tsx": "Manages server settings navigation and displays selected settings pages with a sidebar.",
  "frontend/src/components/settings/UserSettings/pages/AppearancePage.tsx": "Allows users to change theme and text scaling. Uses settings state and theme hooks to apply appearance preferences.",
  "frontend/src/components/settings/UserSettings/pages/ProfilePage.tsx": "Lets users edit profile fields and username while showing account email. Loads and updates profile and username using query mutations.",
  "frontend/src/components/settings/UserSettings/UserSettingsShell.tsx": "Renders the user settings layout with navigation between pages and a logout option. Controls which settings page is active and handles closing the panel.",
  "frontend/src/components/system/BackendConnectionBanner.tsx": "Shows connection status to the backend, including loading and error recovery instructions. Provides a retry option when connection fails.",
  "frontend/src/components/voice/StageView.tsx": "Displays a static stage layout with speakers and audience sections and a button to raise hand.",
  "frontend/src/components/voice/VoiceView.tsx": "Shows voice channel participants, connection status, and join/leave controls using backend presence data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActionGuard.ts": "Returns whether backend actions should be disabled based on backend connection state.",
  "frontend/src/hooks/useBackendConnection.ts": "Determines backend availability by combining safe actor state with a lightweight health check and exposes retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via context.",
  "frontend/src/hooks/useIsMobile.ts": "Detects whether the viewport width is below a given breakpoint and updates on resize.",
  "frontend/src/hooks/useLogout.ts": "Logs out the user and clears all React Query caches.",
  "frontend/src/hooks/useQueries.ts": "Provides typed React Query hooks for fetching and mutating backend data with friendly error handling.",
  "frontend/src/hooks/useSafeActor.ts": "Safely initializes an authenticated or anonymous backend actor with retry and error tracking.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for dark and light themes, plus base styles and a transition utility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/LoginScreen.tsx": "Implements a login and signup UI with form state, validation, and error handling using the auth context.",
  "frontend/src/state/navigation.ts": "Provides a navigation context managing current view, selected server/channel, UI panels, and category expansion.",
  "frontend/src/state/notifications.ts": "Stores and retrieves per-server and per-channel notification mute settings in localStorage.",
  "frontend/src/state/settings.ts": "Implements a settings context with theme, accent color, text scale, notifications, and keybinds persisted to localStorage.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces for servers, channels, roles, members, messages, and audit logs matching backend data.",
  "frontend/src/utils/channelOrdering.ts": "Applies and builds ordering for categories and channels by merging persisted order with current server data.",
  "frontend/src/utils/hideElementByXPath.ts": "Provides utilities to remove a specific DOM element by XPath, including a MutationObserver for ongoing removal.",
  "frontend/src/utils/roleColor.ts": "Provides helpers to sanitize hex color strings and compute luminance-based contrast for text.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, store, retrieve, and clear URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it doesn’t finish within the specified duration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, and animations with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing state, issues, and feature requests for registration logic and credential indexing."
}