{
  "kind": "build_request",
  "title": "Fix backend connection error by adding required register method",
  "projectName": "Caffeine Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a public shared backend actor method named `register` so the frontend runtime actor verification passes (it currently expects a `register` function to exist).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Backend actor missing required authentication methods. Expected: register"
        ]
      },
      "acceptanceCriteria": [
        "The backend canister exports a callable `register` method (Candid/actor method) named exactly `register`.",
        "On app load, `useSafeActor` no longer reports: \"Backend actor missing required authentication methods. Expected: register\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend registration logic that persists a new user's credentials/profile using the existing in-memory stores (e.g., usernames, credentialsStore, userProfiles) and returns a structured result indicating success or a specific error (e.g., already registered, username taken, email taken).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Backend actor missing required authentication methods. Expected: register"
        ]
      },
      "acceptanceCriteria": [
        "Calling `register` with a new username/email stores the user data and returns a success result.",
        "Calling `register` from the same caller principal when already registered returns an error result indicating the user is already registered.",
        "Calling `register` with a username/email that is already in use returns an error result indicating the conflict (username taken and/or email taken)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend authentication flow to call the backend `register` method (instead of simulating registration) and surface backend registration errors as user-facing English messages in the signup flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Backend actor missing required authentication methods. Expected: register"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the signup form triggers an actual backend `register` call.",
        "If backend `register` returns an error (e.g., username taken), the UI shows a clear English error message and the user remains unauthenticated.",
        "On successful registration, the app proceeds to the existing post-registration behavior (e.g., login/session creation) without showing the backend connection error banner."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the frontend TypeScript backend actor typings include the `register` method so the app compiles and `useSafeActor` can safely validate the actor API at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Backend actor missing required authentication methods. Expected: register"
        ]
      },
      "acceptanceCriteria": [
        "The frontend builds successfully with no TypeScript errors related to missing `register` on the backend interface/type.",
        "Runtime verification in `useSafeActor` recognizes `register` as a function on the actor instance."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding external database/storage beyond the canister state.",
    "Implementing real-time communication (WebSockets) or push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}