{
  "kind": "build_request",
  "title": "Fix failing user registration and session creation",
  "projectName": "Caffeine Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend registration persistence so that creating an account actually stores credentials, session tokens, and the initial user profile in canister state (i.e., all Map/collection updates performed during register/login/saveCallerUserProfile must be truly mutating/persisted, not discarded).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Registration failed. Please try again. please just fix it"
        ]
      },
      "acceptanceCriteria": [
        "Creating a new account with a never-before-used Internet Identity succeeds (backend register returns null) and the user is able to proceed to an authenticated state without seeing 'Registration failed. Please try again.'",
        "Immediately after successful registration, a login using the same Internet Identity + the chosen username/email + password returns a non-null Session with a non-empty token",
        "After registration, calling getCallerUserProfile succeeds for the same caller and returns a non-null profile with name set to the sanitized username",
        "After a canister upgrade/redeploy during development, registration still works (no runtime traps due to collection/mutation issues)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make backend registration/login input normalization and uniqueness checks consistent and robust: sanitize (trim + lowercase) username/email/loginIdentifier before checking and storing, and ensure uniqueness checks and lookups always use the sanitized values.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Registration failed. Please try again. please just fix it"
        ]
      },
      "acceptanceCriteria": [
        "Registering with an email that differs only by case or surrounding spaces is rejected with the email-taken error variant",
        "Registering with a username that differs only by case or surrounding spaces is rejected with the username-taken error variant",
        "Logging in with email/username that differs only by case or surrounding spaces still succeeds (when the correct password + Internet Identity are used)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix backend session creation/ownership bookkeeping so that validateSession accepts the token produced by a successful login for the same caller until it expires (no false invalidation due to token ownership mismatches).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Registration failed. Please try again. please just fix it"
        ]
      },
      "acceptanceCriteria": [
        "After login returns a Session, calling validateSession(session.token) as the same caller returns that same session (non-null)",
        "validateSession returns null for expired sessions and for tokens not owned by the caller",
        "A newly registered user can complete the current frontend flow: register -> post-registration login -> session saved -> session validates on refresh"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve frontend error reporting for the registration flow so that when backend registration fails, the UI shows the specific mapped/allowlisted error message (e.g., already registered, username/email taken) rather than the generic 'Registration failed. Please try again.' whenever possible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Registration failed. Please try again. please just fix it"
        ]
      },
      "acceptanceCriteria": [
        "If the backend returns #alreadyRegistered, the Sign Up tab shows the exact allowlisted message from AUTH_MESSAGES.ALREADY_REGISTERED",
        "If the backend returns #usernameTaken or #emailTaken, the Sign Up tab shows the exact allowlisted message from AUTH_MESSAGES.USERNAME_OR_EMAIL_TAKEN",
        "If the backend is not ready/unreachable, the UI shows the existing allowlisted connection message(s) rather than a generic registration failure"
      ]
    }
  ],
  "constraints": [
    "Keep all backend logic in the existing single Motoko actor (backend/main.mo); do not introduce additional backend services.",
    "Use English for all user-facing text.",
    "Do not edit files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is in scope).",
    "Adding an external database or migrating to a different backend technology.",
    "Redesigning unrelated parts of the chat/server/channel features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}