{
  "kind": "build_request",
  "title": "Add admin reset to clean local replica state",
  "projectName": "Server Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend admin-only method that wipes all application data in the canister (intended to “clean the replica”), including servers, channels, roles, memberships, messages/presences, audit logs, friendships/requests/blocks, user profiles/statuses/usernames/emails, session data, and all ordering data, and resets all ID counters back to their initial values.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "clean the replica"
        ]
      },
      "acceptanceCriteria": [
        "Calling the new admin reset method as an admin completes successfully and results in an empty/initial state (e.g., no servers returned, no profiles/sessions retained, no messages/presences, and ID counters behave as if the canister is freshly initialized).",
        "Calling the new admin reset method as a non-admin traps/throws with an Unauthorized-style error message.",
        "After reset, the existing healthCheck endpoint still returns true and normal app flows (register/login, create server) work again from a clean slate."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose a minimal verification endpoint for admins that returns a small set of counts/flags (e.g., number of servers, number of stored profiles, number of sessions, number of audit log entries) so developers can confirm that the replica data was cleaned without inspecting state manually.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "clean the replica"
        ]
      },
      "acceptanceCriteria": [
        "The verification endpoint is admin-only (non-admin calls are rejected).",
        "Immediately after the reset method runs, the verification endpoint reports zeros (or equivalent empty-state values) for all returned counts."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an admin-only control in the frontend user settings that triggers the backend reset (“clean replica”) action with a strong confirmation step (explicit confirmation text) and clear success/error feedback in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "clean the replica"
        ]
      },
      "acceptanceCriteria": [
        "The reset control is only visible/enabled when the current user is an admin (using the existing admin check query).",
        "Triggering the reset shows a confirmation UI that reduces accidental activation (e.g., requires typing a specific phrase).",
        "On success, the UI shows a success message and refreshes/invalidates relevant cached queries so the UI reflects an empty state (e.g., server list clears).",
        "On failure (Unauthorized or network error), the UI shows an English error message without leaving the app in a broken/loading state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add a migration file if state/stable layout changes require it.",
    "Do not edit any frontend files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text added to the UI."
  ],
  "nonGoals": [
    "Do not add third-party database/storage or external admin tooling.",
    "Do not implement multi-canister or microservice architectures.",
    "Do not add new authentication providers beyond the existing Internet Identity flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}