{
  "kind": "build_request",
  "title": "Fix false 'Username or email is already taken' registration error",
  "projectName": "Caffeine Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend registration API to return a specific, non-ambiguous error when registration fails (e.g., distinguish between: caller is not a guest/already registered, username already taken, email already taken) instead of returning `null` for all failure cases.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it says Username or email is already taken. Please try a different one or sign in. when it isnt already taken"
        ]
      },
      "acceptanceCriteria": [
        "When a caller who is not a guest attempts to register, the backend responds with a distinct failure reason that is not conflated with 'username/email taken'.",
        "When the username exists, the backend responds with a distinct 'username taken' reason.",
        "When the email exists, the backend responds with a distinct 'email taken' reason.",
        "The backend does not trap for these expected registration failure cases; it returns a normal response the frontend can interpret."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend registration flow to map backend registration failure reasons to accurate, user-friendly English messages (do not show 'Username or email is already taken' unless the backend explicitly indicates username/email collision).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "it says Username or email is already taken. Please try a different one or sign in. when it isnt already taken"
        ]
      },
      "acceptanceCriteria": [
        "If the backend indicates 'username taken' or 'email taken', the UI shows the existing message `Username or email is already taken. Please try a different one or sign in.` (or a more specific taken message if introduced).",
        "If the backend indicates the caller is already registered / not a guest, the UI shows a distinct message (e.g., `This account is already registered. Please sign in instead.`) and does not show the taken message.",
        "No registration error path shows the taken message unless a true collision is reported by the backend.",
        "All user-facing auth messages remain centralized in `frontend/src/auth/authMessages.ts` and are used consistently by `frontend/src/auth/AuthProvider.tsx` and `frontend/src/pages/LoginScreen.tsx`."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`.",
    "Do not edit files in `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing password hashing or changing authentication/security model.",
    "Adding third-party authentication providers or external databases.",
    "Adding new product features unrelated to registration error correctness."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}