{
  "kind": "build_request",
  "title": "Replace id.ai/Internet Identity with a custom internal account system",
  "projectName": "Roles Admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove Internet Identity (id.ai) as the authentication mechanism and implement a custom, canister-managed account system that supports account registration and login using app-managed credentials (e.g., username/email + password), without relying on Internet Identity or any external identity provider.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "The app no longer prompts users to sign in with Internet Identity and does not call `AuthClient.login()` anywhere in the active login flow.",
        "Users can create a new account and sign in using the app’s own credential flow.",
        "Authentication does not depend on `process.env.II_URL` or any identityProvider URL.",
        "A logged-in session persists across refresh (until explicit logout or expiration)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the backend (single Motoko actor) to support custom accounts and sessions, including secure password storage (hashed + salted) and session issuance/validation for all authenticated actions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes endpoints to register an account, log in, log out, and retrieve the current session/account context.",
        "Passwords are never stored or returned in plaintext; only salted password hashes are stored.",
        "Backend validates a session token for protected operations and rejects calls with missing/invalid/expired tokens with a clear Unauthorized error.",
        "Session tokens can be revoked on logout."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Refactor authorization in `backend/main.mo` so that all user-protected operations currently gated by `AccessControl.hasPermission(accessControlState, caller, #user)` work with the new custom account/session system (i.e., no longer require Internet Identity-derived principals for normal user access).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "After signing in via the new account system, a user can successfully perform actions that previously required `#user` permission (e.g., set username, read/save profile, create/join/leave servers) without using Internet Identity.",
        "If not signed in (no valid session), the same actions fail with an Unauthorized error.",
        "The backend remains a single actor and compiles successfully."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Replace the current frontend authentication wiring (which depends on `useInternetIdentity`) with a new custom Auth provider/hook that manages session tokens and exposes `login`, `logout`, `register`, and `authStatus` for the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` determines authenticated vs unauthenticated state using the new custom auth context (not `useInternetIdentity`).",
        "The unauthenticated screen supports both “Create account” and “Sign in” flows.",
        "Logout clears the session token and resets relevant cached queries similarly to the current behavior."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update all frontend React Query data hooks/mutations that call authenticated backend methods (see `frontend/src/hooks/useQueries.ts`) to include/attach the new session token so authenticated operations continue to work end-to-end.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "When logged out, authenticated queries/mutations are disabled or fail with a user-friendly Unauthorized message.",
        "When logged in, existing features that require authentication (profile setup/save, server create/join/leave, role actions, messaging where applicable) work using the session-based auth.",
        "No React Query hook relies on an Internet Identity identity being present to function."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Keep immutable frontend hook files unmodified by introducing new auth/session hooks in new files and updating only editable app code to use them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to any path listed in `frontend.immutablePaths` (including `frontend/src/hooks/useInternetIdentity.ts` and `frontend/src/hooks/useActor.ts`).",
        "The application builds and runs using the new auth flow without requiring edits to immutable files."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update user-facing authentication UI copy to reflect the new account system (no references to Internet Identity), and apply a consistent, coherent visual theme to the auth screens and related auth UI states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Redo the account system completely, I do not want to use id.ai for the accounts."
        ]
      },
      "acceptanceCriteria": [
        "Login/registration screens use English text that describes the custom sign-in/sign-up flow and does not mention Internet Identity or id.ai.",
        "Auth screens use a consistent theme (colors/typography/layout) that is applied uniformly across login, registration, and error states.",
        "Theme choice avoids introducing new product features and only affects look-and-feel and presentation."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`; only add `backend/migration.mo` if a state upgrade is required.",
    "Do not edit files under `frontend/src/components/ui` (compose them only).",
    "Do not modify any immutable frontend paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not integrate third-party authentication providers (including Internet Identity, OAuth, Auth0, etc.).",
    "Do not add external databases or off-chain storage for accounts.",
    "Do not add real-time features (WebSockets) as part of the account rewrite.",
    "Do not implement payments or email/SMS verification as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}