{
  "kind": "build_request",
  "title": "Server member roles on profiles, role assignment, and role-colored usernames",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expose server member role data needed by the UI: provide backend APIs to (a) list a server’s roles, (b) fetch a server’s members including each member’s assigned role IDs, and (c) resolve a member’s effective display role color (use the highest-position role when multiple roles are assigned; if none, return null/empty so the UI can use the default text color).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make roles show up on users profiles in servers, allow giving roles, make the users name color their role color (if none keep default color)"
        ]
      },
      "acceptanceCriteria": [
        "Given a valid serverId, the backend returns the server’s roles (id, name, color, position).",
        "Given a valid serverId, the backend returns the server’s members with role IDs attached to each member (matching the existing ServerMember.roles shape).",
        "For any server member, the backend can provide the member’s effective role color based on the highest-position assigned role; when the member has no roles, the returned value indicates ‘no role color’ so the frontend can keep default styling.",
        "All role/member APIs enforce appropriate authorization (e.g., only server members can view server member role assignments)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement role assignment management in the backend: add/update methods that allow authorized users (server owner/admins or users with a suitable role permission) to assign and remove roles for a specific server member, and record audit log entries for role assignment/removal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "allow giving roles"
        ]
      },
      "acceptanceCriteria": [
        "An authorized caller can assign a role (roleId) to a target member (userId) within a server (serverId).",
        "An authorized caller can remove a role (roleId) from a target member (userId) within a server (serverId).",
        "Attempting to assign/remove roles without sufficient permissions fails with an Unauthorized-style error.",
        "Assigning/removing roles creates audit log entries using the existing audit event types (#RoleAssignedToUser / #RoleRemovedFromUser) with meaningful details."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add React Query hooks in frontend/src/hooks/useQueries.ts for: fetching server roles, fetching server members with role IDs, and assigning/removing a role for a server member; ensure mutations invalidate the relevant cached queries so Member List and Profile overlay reflect changes immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make roles show up on users profiles in servers, allow giving roles"
        ]
      },
      "acceptanceCriteria": [
        "There are query hooks to load roles for the selected server and member role IDs for the selected server.",
        "There are mutation hooks to assign/remove roles for a server member.",
        "After a successful assign/remove mutation, the server members query and any role-related queries used by the profile overlay/message list are invalidated/refetched so UI updates without a full reload.",
        "Errors are surfaced using the existing friendly toast/error patterns in useQueries.ts."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Show a member’s roles on their server profile overlay (frontend/src/components/profile/UserProfileOverlay.tsx) when the overlay is opened from within a server context: display role chips/badges with the role name and role color; if the member has no roles, do not show a roles section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make roles show up on users profiles in servers"
        ]
      },
      "acceptanceCriteria": [
        "When viewing a member profile while a server is selected, the overlay includes a ‘Roles’ section listing the member’s assigned roles.",
        "Each displayed role uses its configured color (e.g., colored dot or colored chip accent) and shows the role name in readable contrast.",
        "If no server is selected, or the member has no roles in that server, the overlay does not show an empty roles section."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Allow assigning roles to users in a server from the UI: add role assignment controls accessible from the server member profile overlay and/or member list, including a list of available roles with current assignments indicated, and actions to add/remove roles (restricted/hidden for unauthorized users).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "allow giving roles"
        ]
      },
      "acceptanceCriteria": [
        "When a user with permission views another member’s profile in a server, they can assign and remove roles using a clear control (e.g., dialog/sheet with role checkboxes).",
        "Current role assignments for that member are shown as selected/checked.",
        "Users without permission do not see role assignment controls (or controls are disabled with a clear unauthorized state).",
        "After changing roles, the member list and profile overlay update to reflect the new roles."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply role color to usernames in server contexts: update message author name rendering (frontend/src/components/chat/MessageItem.tsx) and server member list rendering (frontend/src/components/members/MemberListPanel.tsx) so the displayed name uses the member’s effective role color; if the member has no roles, keep the default text color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make the users name color their role color (if none keep default color)"
        ]
      },
      "acceptanceCriteria": [
        "In chat messages, the author name text is styled with the effective role color when the message is in a server channel context.",
        "In the member list, each member’s display name is styled with the effective role color when they have a role with a color.",
        "If a member has no roles (or role color is unavailable), names render with the existing default text color (no forced coloring).",
        "Color styling does not reduce readability in light/dark themes (e.g., ensure adequate contrast by using the provided role color primarily for text and falling back safely if invalid)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration (backend/migration.mo) if persistent state schema changes are required.",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Creating a new permissions system beyond using the existing role permissions model and current admin/owner checks.",
    "Role ordering UX changes (drag/drop reordering) unless required to determine ‘highest role’ beyond the existing Role.position field.",
    "Displaying roles or role-color names in non-server contexts such as DMs/friends list, unless those views are explicitly within a server context."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}