{
  "kind": "build_request",
  "title": "Fix infinite loading by surfacing backend connection errors and adding retry",
  "projectName": "Server Chat",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent the app from being stuck on the global \"Loading...\" screen by ensuring auth initialization always resolves to a non-initializing state (authenticated or unauthenticated) even when the backend connection is not ready or becomes unreachable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "now its just stuck loading"
        ]
      },
      "acceptanceCriteria": [
        "If the backend is unreachable or the health check fails, the app does not remain in authStatus === 'initializing' indefinitely.",
        "Within a bounded time (e.g., after a short timeout) the UI transitions away from the full-screen Loading state to either the Login screen or an explicit connection error state with user action available.",
        "When a stored session exists but backend readiness never occurs, the session is cleared (or marked invalid) and the user is returned to the Login screen with an English error message indicating the backend is not reachable."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement and render a backend connection status banner/component that clearly shows connection state (loading/ready/error) and provides a Retry action that re-attempts actor initialization and health check.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "now its just stuck loading"
        ]
      },
      "acceptanceCriteria": [
        "A non-empty implementation exists for frontend/src/components/system/BackendConnectionBanner.tsx.",
        "When connection state is 'error', the banner shows an English error message and a Retry button.",
        "Clicking Retry triggers the existing retry flow (via useBackendConnection().retry) and updates the UI state accordingly.",
        "The banner is visible on the global Loading screen and/or other appropriate top-level surfaces so users are not left without feedback."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden backend health checking so that a hanging/slow healthCheck call cannot keep the UI in a perpetual loading state (e.g., add a client-side timeout and surface a clear error).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "now its just stuck loading"
        ]
      },
      "acceptanceCriteria": [
        "If healthCheck does not resolve within the configured timeout, the connection state becomes 'error' with an English error message.",
        "The error state is recoverable via Retry without requiring a hard refresh.",
        "The app no longer appears to be endlessly loading when the backend is down or misconfigured."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn UI components).",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Implementing the backend login endpoint (login/logout) beyond the existing register/validateSession flow.",
    "Adding new third-party monitoring/analytics or external services for error reporting."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}