{
  "kind": "build_request",
  "title": "Fix sign-up by auto-assigning default user role without admin permissions",
  "projectName": "Caffeine Chat",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend registration so that every newly registered account is automatically assigned the default \"user\" role without requiring the caller to be an admin, ensuring sign-up no longer fails with \"Unauthorized: Only admins can assign user roles\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-7"
        ],
        "quotes": [
          "1"
        ]
      },
      "acceptanceCriteria": [
        "A brand-new principal can call register successfully without any pre-existing roles/permissions.",
        "After successful registration, getCallerUserProfile does not trap with \"Unauthorized: Only users can view profiles\" for the same principal.",
        "The registration flow does not trigger or surface the error text \"Unauthorized: Only admins can assign user roles\" during sign-up."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend \"register\" method never traps due to role assignment during sign-up; if role assignment fails for any reason, the method must return RegistrationResult.#error with an appropriate RegistrationError instead of trapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-3",
          "recent-messages-6"
        ],
        "quotes": [
          "Unauthorized: Only admins can assign user roles",
          "it gives this error when is ign up"
        ]
      },
      "acceptanceCriteria": [
        "Register does not trap during role assignment; it returns a RegistrationResult value in all cases.",
        "Frontend receives a structured RegistrationResult response (success or error) rather than a canister trap for the sign-up path."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files in frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not make all users admins by default.",
    "Do not remove the role/permission system from the app.",
    "Do not redesign the authentication UI beyond what is required to confirm the backend fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}