{
  "kind": "build_request",
  "title": "Fix false-positive “already registered” error during sign up",
  "projectName": "Caffeine Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend registration logic so that a user is only blocked from registering when the caller principal already has stored credentials (i.e., has actually registered before), rather than blocking purely based on the caller’s current AccessControl role being non-guest.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now its saying This account is already registered. Please sign in instead. even though there is no account registered for that."
        ]
      },
      "acceptanceCriteria": [
        "When a principal that has no stored credentials attempts to register, the backend does not return the notAGuest error.",
        "When a principal that already has stored credentials attempts to register again, the backend returns a deterministic error indicating the account is already registered (existing notAGuest or a more specific variant).",
        "Username and email uniqueness checks still work and return the correct error variants when taken."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a backend index for credentials by principal and keep it in sync on registration so the backend can reliably determine whether the caller principal has previously registered.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now its saying This account is already registered. Please sign in instead. even though there is no account registered for that."
        ]
      },
      "acceptanceCriteria": [
        "After a successful registration, the backend can look up the caller principal and find their credentials via the principal index.",
        "The principal index remains consistent with the username- and email-indexed credential stores for newly created registrations."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If the backend state schema is changed to add a principal-indexed credentials store, implement a conditional upgrade migration that backfills the principal index from existing stored credentials.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now its saying This account is already registered. Please sign in instead. even though there is no account registered for that."
        ]
      },
      "acceptanceCriteria": [
        "Upgrading an existing deployment that already has registered users results in the principal index being populated for those users.",
        "Upgrading a fresh deployment (no prior credentials) does not trap and results in an empty principal index."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update frontend registration error messaging to avoid telling users an account exists when the error is actually caused by being signed in / not being a guest. Use clear English user-facing text that matches the real cause and remediation steps.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now its saying This account is already registered. Please sign in instead. even though there is no account registered for that."
        ]
      },
      "acceptanceCriteria": [
        "If the backend returns the notAGuest registration error, the UI shows an English message that indicates the user is already signed in (or otherwise not eligible to register) and what to do next.",
        "No user-facing text claims an account is registered unless the backend condition truly reflects an existing registration for that principal."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Only create/modify backend/migration.mo if needed for a state upgrade (conditional migration policy).",
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Implementing password reset, account recovery, or email verification.",
    "Adding third-party authentication beyond Internet Identity.",
    "Adding an external database or off-chain storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}