{
  "kind": "build_request",
  "title": "Implement backend registration endpoint and connect frontend auth to it",
  "projectName": "Community Chat",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a backend authentication registration endpoint that the frontend can call instead of throwing the current placeholder error. The endpoint must create a new account using the provided username, email, and password, and return a session object containing token, accountId, and expiresAt (matching the signature expected in frontend/src/auth/AuthProvider.tsx comments).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "IT STILL SAYS Registration endpoint not yet implemented in backend. Please wait for backend authentication system to be updated.\nERROR"
        ]
      },
      "acceptanceCriteria": [
        "The backend canister exports a callable method for registration with inputs (username, email, password).",
        "On successful registration, the method returns a response object containing token, accountId, and expiresAt (Nat) compatible with the frontend expectations.",
        "Attempting to register with a username that is already taken returns a clear error (trap or variant) rather than silently overwriting.",
        "The backend persists the created account so that subsequent calls behave consistently after canister upgrade/restart."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend auth flow to call the backend registration endpoint and remove the hardcoded thrown error string \"Registration endpoint not yet implemented in backend. Please wait for backend authentication system to be updated.\". On success, store the returned session via sessionStorage.save and transition authStatus to \"authenticated\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "IT STILL SAYS Registration endpoint not yet implemented in backend. Please wait for backend authentication system to be updated.\nERROR"
        ]
      },
      "acceptanceCriteria": [
        "Creating an account from the \"Create Account\" tab no longer shows the placeholder backend-not-implemented error.",
        "After successful registration, the app persists session data in localStorage using frontend/src/auth/sessionStorage.ts and the UI transitions into the authenticated app state without requiring a refresh.",
        "If backend registration fails, the UI shows a user-facing error message in English (using the existing alert in frontend/src/pages/LoginScreen.tsx)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a backend session validation endpoint and wire it into session restore in the frontend so that when a saved session exists, the app validates it with the backend before setting authStatus to \"authenticated\" (replacing the current 'Temporary: assume stored session is valid' behavior).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "IT STILL SAYS Registration endpoint not yet implemented in backend. Please wait for backend authentication system to be updated.\nERROR"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a validateSession(token) method that returns a boolean (or equivalent) indicating whether the session is valid and unexpired.",
        "On page reload with a stored session, AuthProvider calls validateSession and clears local session + sets authStatus to unauthenticated when invalid.",
        "On page reload with a valid stored session, the user remains authenticated without seeing an auth error state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo (per project architecture).",
    "Only create backend/migration.mo if required by conditional migration policy due to newly added stable state.",
    "Do not edit files in frontend immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose existing UI components instead).",
    "Use English for all user-facing strings."
  ],
  "nonGoals": [
    "Implement third-party authentication providers (only Internet Identity is supported).",
    "Add external databases or non-Motoko backend services.",
    "Implement real-time auth updates via websockets/push notifications.",
    "Redesign the entire login/sign-up UI beyond what is necessary to remove the registration-not-implemented error and complete the registration flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}