{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Community Chat — Wire frontend registration + session validation to backend auth",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Call backend registration capability from the frontend auth provider and persist the returned session to transition into authenticated state.",
      "acceptanceCriteria": [
        "Creating an account from the \"Create Account\" tab no longer shows the placeholder backend-not-implemented error.",
        "After successful registration, the app persists session data in localStorage using frontend/src/auth/sessionStorage.ts and the UI transitions into the authenticated app state without requiring a refresh.",
        "If backend registration fails, the UI shows a user-facing error message in English (using the existing alert in frontend/src/pages/LoginScreen.tsx)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/auth/AuthProvider.tsx",
          "operation": "modify",
          "description": "Replace the thrown placeholder registration error with a real call to the backend register capability (actor.register with { username, email, password } payload per frontend/src/backend.d.ts), then on success persist the session via sessionStorage.save (converting expiresAt bigint to number) and set authStatus to \"authenticated\" + update sessionToken/accountId. Ensure failures set authStatus to \"error\" and rethrow an English message consumed by LoginScreen's existing alert."
        },
        {
          "path": "frontend/src/auth/sessionStorage.ts",
          "operation": "modify",
          "description": "Add a small helper (or adjust save validation) to safely accept backend session values (notably expiresAt as bigint from the backend interface) by converting to a number before persisting, while keeping existing localStorage key and expiry checks consistent."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Validate restored sessions with the backend before marking the user authenticated, and clear invalid sessions on restore.",
      "acceptanceCriteria": [
        "Backend exposes a validateSession(token) method that returns a boolean (or equivalent) indicating whether the session is valid and unexpired.",
        "On page reload with a stored session, AuthProvider calls validateSession and clears local session + sets authStatus to unauthenticated when invalid.",
        "On page reload with a valid stored session, the user remains authenticated without seeing an auth error state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/auth/AuthProvider.tsx",
          "operation": "modify",
          "description": "Replace the current \"Temporary: assume stored session is valid\" restore behavior by calling the backend validateSession capability (actor.validateSession(token) which returns Session|null per frontend/src/backend.d.ts). If null or expired, clear sessionStorage and set authStatus to \"unauthenticated\"; if valid, update sessionToken/accountId and set authStatus to \"authenticated\". Ensure this only runs once the backend connection is ready and does not flash an error state during normal restore."
        },
        {
          "path": "frontend/src/auth/sessionStorage.ts",
          "operation": "modify",
          "description": "Ensure session clearing and expiration checks support the updated restore flow (e.g., provide a dedicated clear+return-null path or helper used by AuthProvider) so invalid/expired sessions are removed deterministically during restore."
        }
      ]
    }
  ]
}