{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Server roles on profiles, assignment controls, and role-colored usernames (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add React Query hooks for server roles, server members (with role IDs), and role assign/remove mutations with proper cache invalidation and friendly errors.",
      "acceptanceCriteria": [
        "There are query hooks to load roles for the selected server and member role IDs for the selected server.",
        "There are mutation hooks to assign/remove roles for a server member.",
        "After a successful assign/remove mutation, the server members query and any role-related queries used by the profile overlay/message list are invalidated/refetched so UI updates without a full reload.",
        "Errors are surfaced using the existing friendly toast/error patterns in useQueries.ts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/align hooks and query keys for: fetching server roles (use existing getServerRoles/getRoles backend capability as appropriate), fetching server members with role IDs (use existing getServerMembers backend capability), fetching a member’s effective display color (use getMemberDisplayColor backend capability), and mutations for assign/remove role (use assignRoleToUser/removeRoleFromUser backend capabilities). Ensure mutations invalidate/refetch member lists, any per-member display color queries, and any overlay/member-related queries; continue using existing toast + friendly error handling patterns."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Show a member’s roles on the server profile overlay in server context using colored role chips/badges.",
      "acceptanceCriteria": [
        "When viewing a member profile while a server is selected, the overlay includes a ‘Roles’ section listing the member’s assigned roles.",
        "Each displayed role uses its configured color (e.g., colored dot or colored chip accent) and shows the role name in readable contrast.",
        "If no server is selected, or the member has no roles in that server, the overlay does not show an empty roles section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/UserProfileOverlay.tsx",
          "operation": "modify",
          "description": "When the overlay is opened with a selected server context, fetch the server’s roles and the selected member’s role IDs (via hooks in frontend/src/hooks/useQueries.ts), then render a conditional ‘Roles’ section. Map role IDs to role objects and render role chips/badges showing the role name and role color (with readable contrast). Do not render the section when no server is selected or the member has no roles. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/roleColor.ts",
          "operation": "create",
          "description": "Add small shared utilities to (a) validate/sanitize role color strings for safe inline styling and (b) choose a readable foreground/contrast strategy for chips where needed (light/dark). This is used by UserProfileOverlay, MessageItem, and MemberListPanel."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add role assignment controls in the server member profile overlay with current assignments shown and unauthorized users hidden/disabled.",
      "acceptanceCriteria": [
        "When a user with permission views another member’s profile in a server, they can assign and remove roles using a clear control (e.g., dialog/sheet with role checkboxes).",
        "Current role assignments for that member are shown as selected/checked.",
        "Users without permission do not see role assignment controls (or controls are disabled with a clear unauthorized state).",
        "After changing roles, the member list and profile overlay update to reflect the new roles."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/RoleAssignmentDialog.tsx",
          "operation": "create",
          "description": "Create a profile-overlay-scoped dialog/sheet component that lists available server roles with selection state matching the target member’s current role IDs, and supports toggling roles using assign/remove mutation hooks from frontend/src/hooks/useQueries.ts. Include a clear interaction pattern (e.g., checkbox list) and loading/disabled states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/profile/UserProfileOverlay.tsx",
          "operation": "modify",
          "description": "Wire the new RoleAssignmentDialog into the overlay (only when a server is selected). Determine whether to show/enable the control using existing frontend signals (e.g., isCallerAdmin via existing hook and/or server owner match via server data + current identity if already available in the app). Hide the control for clearly unauthorized users (or disable with an unauthorized hint), and rely on mutation error handling for any backend authorization failures. Ensure successful mutations update the overlay state via React Query invalidation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Apply effective role color to usernames in server contexts for chat messages and the member list, falling back to default styling.",
      "acceptanceCriteria": [
        "In chat messages, the author name text is styled with the effective role color when the message is in a server channel context.",
        "In the member list, each member’s display name is styled with the effective role color when they have a role with a color.",
        "If a member has no roles (or role color is unavailable), names render with the existing default text color (no forced coloring).",
        "Color styling does not reduce readability in light/dark themes (e.g., ensure adequate contrast by using the provided role color primarily for text and falling back safely if invalid)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/chat/MessageItem.tsx",
          "operation": "modify",
          "description": "In server channel contexts, fetch the author’s effective display role color using a new hook from frontend/src/hooks/useQueries.ts (backed by getMemberDisplayColor) keyed by selected server and author userId. Apply the color to the author name text only when a valid color is available; otherwise keep current default styling. Use frontend/src/utils/roleColor.ts to validate/sanitize colors and avoid unreadable/invalid values. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/members/MemberListPanel.tsx",
          "operation": "modify",
          "description": "For each member row in a selected server, fetch that member’s effective display role color using a new hook from frontend/src/hooks/useQueries.ts (backed by getMemberDisplayColor). Style the displayed member name with the effective color when present and valid; otherwise keep existing default text color. Use frontend/src/utils/roleColor.ts to validate/sanitize colors and ensure safe fallbacks for readability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/roleColor.ts",
          "operation": "modify",
          "description": "Extend utilities (if needed) to support consistent validation/sanitization and safe fallback behavior for text coloring in both message list and member list, preserving readability across light/dark themes."
        }
      ]
    }
  ]
}