{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "New project",
  "architectural_notes": [],
  "known_issues": [
    "Registration flow incorrectly reports \"This account is already registered\" for emails/users that are not actually registered (false-positive duplicate account error)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-frontend-registration-error-messaging-to-avoid-telling-users-an-account-exists-when-the-error-is-actually-caused-by-being-signed-in-not-being-a-guest-use-clear-english-user-facing-text-that-matches-the-real-cause-and-remediation-steps",
      "title": "Update frontend registration error messaging to avoid telling users an account exists when the error is actually caused by being signed in / not being a guest. Use clear English user-facing text that matches the real cause and remediation steps.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update the backend registration logic so that a user is only blocked from registering when the caller principal already has stored credentials (i.e., has actually registered before), rather than blocking purely based on the caller’s current AccessControl role being non-guest.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a backend index for credentials by principal and keep it in sync on registration so the backend can reliably determine whether the caller principal has previously registered.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "If the backend state schema is changed to add a principal-indexed credentials store, implement a conditional upgrade migration that backfills the principal index from existing stored credentials.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Caffeine Chat",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}