{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-17T01:16:31.484Z",
  "summary": "Backend registration now checks a new credentials-by-principal index and returns an #alreadyRegistered variant when the caller principal already has credentials; a migration module backfills that index from existing credentials. Frontend adds new auth messaging/mapping utilities, but the specific REQ-4 requirement about handling the backend’s notAGuest error is not evidenced in the diff.",
  "missing_requirements": [
    {
      "id": "REQ-4",
      "requirement": "If the backend returns the notAGuest registration error, the UI shows an English message that indicates the user is already signed in (or otherwise not eligible to register) and what to do next; and no user-facing text claims an account is registered unless the backend condition truly reflects an existing registration for that principal.",
      "reason": "The diff shows frontend mapping for an \"alreadyRegistered\" backend error, but there is no evidence of handling/messaging for a \"notAGuest\" registration error variant as explicitly required.",
      "evidence": [
        "frontend/src/auth/authMessages.ts"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Allowlisted auth message sanitization (sanitizeAuthMessage), error-flow categorization (getErrorFlow), and generic login/session/connection message constants beyond the registration messaging change.",
      "reason": "BuildRequest REQ-4 is limited to updating registration error messaging to avoid misleading \"account exists\" text for notAGuest scenarios; the added allowlisting/sanitization and broader auth-flow categorization are not requested.",
      "evidence": [
        "frontend/src/auth/authMessages.ts"
      ]
    }
  ],
  "confidence": 0.64,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/auth/authMessages.ts",
    "project_state.json"
  ]
}